const locale = {
  global: {
    buttons: {
      next: '次へ',
      prev: '前へ',
      back: '戻る',
      close: '閉じる',
      submit_form: '送信する',
      contact_us: 'お問い合わせ',
      view_the_service: 'もっと詳しく',
      view_all_project: 'もっと詳しく',
      view_more: 'もっと詳しく'
    },
    footer: {
      address: ' （803）臺灣高雄市鹽埕區大勇路11號3樓'
    }
  },
  homepage: {
    slogan: '想像 × 創造 × 未来',
    description: [
      '本舞台は常に将来にあり、私たちは最適なデザインと技術でビジネス課題を解決する。',
      '経験分野は食と農業、製造と工芸、地方課題'
    ],
    research: {
      title: 'RESEARCH  理解の深さ',
      subtitle: '根本の課題とニーズを洞察する',
      text: [
        '琥白は、大量の研究に基づき、顧客の意図をサポートします。',
        '望む変革を実現するために、着実な条件を考慮します。'
      ]
    },
    concept: {
      title: 'CONCEPT  思考の広さ',
      subtitle: '既存の枠にとらわれない領域横断的なコンセプト',
      text: [
        '琥白のメンバーは、さまざまな専門知識のバックグラウンドを持っています。',
        '顧客と革新的なコンセプトを多角的に議論します。'
      ]
    },
    solutions: {
      title: 'SOLUTION  最適なデザイン',
      subtitle: ['五つの領域', '三つの言語'],
      system: {
        name: 'システム設計 / 開発と運用',
        shortName: 'システム設計 / 開発と運用',
        subtitleSentences: [
          'お客様の要望によって、システム構築し、',
          '将来の展望を築くためのサポートを提供いたします'
        ],
        textSentences: [
          'SaaS（Software as a Service）のソフトウェアサービスから、お客様の要件に最適なシステムを構築し、業務プロセスを効率化いたします。'
        ],
        keywordList: [
          {
            name: 'システム開発',
            children: ['フロントエンド', 'バックエンド']
          },
          {
            name: 'データ分析',
            children: ['ビジネスデータ分析']
          },
          {
            name: '受託開発',
            children: ['組み込みシステム開発']
          }
        ]
      },
      trading: {
        name: '国際貿易サービス',
        shortName: '国際貿易サービス',
        subtitleSentences: ['台湾の美味しい食文化の発掘し', '国際を向けて歩み出す'],
        textSentences: [
          '台湾と日本の農産物および食品の双方向の供給と販売、さらに農業機械の代理サービスを提供します。MIT(Made in Taiwan)を世界に立ち上げるように、対象國の輸入輸出の商品相談 / 消費習慣に合わせたブランドパッケージ作成 / 輸出代行などのサービスを提供しています。'
        ],
        keywordList: [
          {
            name: '輸入輸出の商品相談'
          },
          {
            name: '対象國の消費習慣の調査'
          },
          {
            name: 'マーケティングプランの立ち上げ'
          },
          {
            name: '中国語 / 英語 / 日本語の窓口'
          },
          {
            name: '対象國に向けてブランドパッケージの作成'
          }
        ]
      },
      product: {
        name: 'プロダクトデザイン',
        shortName: 'プロダクトデザイン',
        subtitleSentences: [
          '既存の製品の問題点を突き込んで',
          '世の中の動向やトレンドを把握しつつ、斬新なデザインで痛点を解消していく'
        ],
        textSentences: [
          'ユーザー視点から機能と形を考え、',
          '繊細なデザインで製品を仕上げていきます。'
        ],
        keywordList: [
          {
            name: '要件まとめ'
          },
          {
            name: 'コンセプト提案'
          },
          {
            name: '競合商品の研究'
          },
          {
            name: '產品外觀設計プロダクトデザイン'
          },
          {
            name: '3Dモデル作成'
          },
          {
            name: 'プロダクト・立体制作'
          }
        ]
      },
      design: {
        name: 'グラフィックデザイン',
        shortName: 'グラフィックデザイン',
        subtitleSentences: [
          '一つのデザインで、お客様の商品の魅力を作り出して',
          'ブランドの可能性を呼び起こすＦ'
        ],
        textSentences: [
          'お客様の目指している目標や改善したい事にデザインをかけて、',
          '形にしていきます'
        ],
        keywordList: [
          {
            name: 'ブランディングデザイン'
          },
          {
            name: 'ブックデザイン'
          },
          {
            name: 'グラフィックデザイン'
          },
          {
            name: 'パッケージデザイン・制作'
          },
          {
            name: 'UI / UXデザイン'
          }
        ]
      },
      planning: {
        name: '企画とイベント実行',
        shortName: '企画とイベント実行',
        subtitleSentences: ['様々の分野からの人材で、', 'お客様のいろんな発想を輝かしく'],
        textSentences: [
          'お客様の要望によって、外部のチームとコラボし、',
          '研修、イベント、展示会に対するのサービスを提供しております。'
        ],
        keywordList: [
          {
            name: '研修、イベント、展示会の計画'
          },
          {
            name: 'コンテンツ企画'
          },
          {
            name: '実行統括'
          },
          {
            name: '現場の司会と場務'
          },
          {
            name: 'イベントの視覚デザインとメディア代行'
          }
        ]
      }
    },
    work: {
      system: {
        name: 'システム設計 / 開発と運用',
        text: 'システム設計 / 開発と運用',
        projects: [
          {
            name: '生産・販売統合システム｜日本農産のBtoB物流サービス',
            description: `農産品流通日本企業「やさいバス（Vegibus）」と連携し、地産地消の持続可能な供給を推進しています。やさいバスシステムでは、生産地の供給、配送状況、注文と支払い情報を一元化し、複雑な物流プロセスにおいて、複数の農家からの商品受け取り、集荷、沿線での配送を効率的に実現しました。
                        現在では、日本の静岡県、茨城県、千葉県、大阪府などで地域の農産物流通ネットワークを構築し、消費者が高鮮度な野菜や果物を楽しむことができるだけでなく、地域食品生産に対する友好的で持続可能な関係を築いています。`
          },
          {
            name: 'ロボット台車開発｜自動移動ロボットの操作インタフェース',
            description: `モバイルムーバー（Mobile Mover）は、屋外作業用のモビリティです。高齢化による農業労働力の急激な減少という地域の課題に対処するため、エムスクエア・ラボとスズキが共同で開発し、操作インタフェースを琥白に依頼しました。
                        操作方法は、ジョイスティック式、有線追尾式、リモコン式の3つのパターンがあります。スズキの高度な電動車椅子の走行技術による安定した足回りと高い耐環境性により、荷物の搬送や乗車だけでなく、防除などの農作業にも応用することができます。`
          }
        ]
      },
      trading: {
        name: '国際貿易サービス',
        text: '国際貿易サービス',
        projects: [
          {
            name: '国際貿易｜屏東県の金鑽パイナップルを日本へ輸出',
            description:
              '台湾屏東県の「緑地農特産品生産協同組合」と農産販売日本物流企業「やさいバス」の連携を図り、台湾パイナップルを一番新鮮な状態で日本の地元スーパーマーケットカスミに直接供給しました。これは民間による農産品の輸出革新であり、農家から直接消費者への配送により、製品の新鮮さと価格競争力が大幅に向上し、輸出経路を短縮によって、農民の収益も増やしました。また、日本の人々も鮮度がより高い、そしてより手頃な価格で台湾パイナップルを楽しむことができます。'
          }
        ]
      },
      product: {
        name: 'プロダクトデザイン',
        text: 'プロダクトデザイン',
        projects: [
          {
            name: '家具デザイン｜慕廂－優雅で可動性を備えた実木家具',
            description:
              '現代の居室やオフィスの柔軟性や共有性に対する要求に応えるために、慕廂は実木家具のコンパクトさに重点を置き、組み立てよりたたむことを重視していました。テーブル、椅子、サイドボードのたたむデザインに通じ、優雅で簡単な移動を実現しました。'
          }
        ]
      },
      design: {
        name: 'グラフィックデザイン',
        text: 'グラフィックデザイン',
        projects: [
          {
            name: 'ブックデザイン｜木工技術の本',
            description: `国立台湾工芸研究開発センターとコラボし、職人にいる現場を実際に伺い、機械操作の映像や口述の情報を収集しました。そして職人の50年間の技術の粋をこの本にまとめ、政府の出版物として出版しました。
                        国家書店政府出版品のリンク：https://www.govbooks.com.tw/books/137952`
          },
          {
            name: 'グラフィックデザイン｜M2Labo 名刺デザイン',
            description:
              '鮮やかな朝陽と夕陽は日本の国旗を象徴し、両面のイメージは企業が日の出から始まり、日没まで努力を惜しまない精神を表しています。'
          },
          {
            name: 'グラフィックデザイン｜高畠町役場名刺デザイン',
            description:
              '正面のロゴは市内の国家重要文化財である「旧高畠駅」と結びつき、裏面のエレガントなテクスチャーは特産品である「高畠石」から取り入れました。地域の風情に囲まれた細部のディテールは、基層機関と地域のつながりを強化し、初対面の名刺交換により多くの驚きと話題があるようにデザインしました。'
          },
          {
            name: 'パッケージデザイン｜ニラキムチ',
            description:
              '農家の地産地消の利点を活かし、ニラの漬け物特産品の開発を支援し、パッケージデザインを提案しました。これにより、農産物の加工付加価値を向上させることができます。'
          },
          {
            name: '商業空間｜広島三原駅の無人八百屋',
            description:
              'JR西日本の地域の駅に設置された無人店舗は、陳列設備、空間、店内の視覚的一貫性を調整し、快適さと実用性のバランスを兼ね備え、自由で便利なショッピング体験を提供しました。'
          }
        ]
      },
      planning: {
        name: '企画発想とイベント実行',
        text: '企画発想とイベント実行',
        projects: [
          {
            name: 'イベント企画｜木工旋盤技術の研究ワークショップ',
            description: `国立台湾工芸研究開発センターとコラボし、現地で映像や口述の情報を収集し、職人の50年間の技術の精華を記録させていただきました。映像編集や映像記録は、活動終了日に上映され、活動の締めくくりとして使用されていました。
                        旋盤のイベント記録のリンクはこちら：https://youtu.be/fygtvFBfvxU`
          }
        ]
      }
    },
    contact: {
      subtitle: 'どんな要望でも大歓迎！気軽にお問い合わせください。',
      text: 'ご要望やりクエスト等ございましたら、下記フォームにご記入いただき、営業日以内に、担当者よりご連絡いたします。'
    }
  },
  about: {
    description: {
      introduction: `琥白（コハク）の物語は、2021と2022の間に、分野横断の若者達から始まりました
            故郷に期待を持っているこそ、台湾で根を下ろした
            社会に希望を持っているこそ、基盤産業に力を注いでいる`,

      mission_values: `文化の美しいところを広める以外に
            イノベーションを産業に打ち込んで
            情報工学とデザインの力で地域と国際を繋げていく

            事業計画からマーケティング
            デザインから開発
            産地から世界
            伝統から革新

            分野横断な思考を基点として
            サプライチェーンの点と点を繋げていく
            様々な分野でイノベーションを起こす
            風立ちぬ`
    },

    brand: {
      name: '琥白 Kohaku',
      meaning: `琥珀（コハク）は、天然樹脂の化石であり、宝石である。すべての生命をやさしく包み込めて、輝かしいタイムカプセルになっていく

            白は、余白の美を導く白であり、余韻を感じられるように、私たちのデザインで道を開く`
    },

    milestone: [
      {
        date: '2021/09',
        content: [
          '「株式会社エムスクエア・ラボ（m2labo）」、「株式会社やさいバス（Vegibus）」とコラボし',
          '「創次方股份有限公司」を創設'
        ]
      },
      {
        date: '2022/04',
        content: ['111年文部科學省「U-start創新創業計畫」により第一段階事業補助金受賞']
      },
      {
        date: '2022/07',
        content: ['「琥白股份有限公司」を創設']
      },
      {
        date: '2022/08',
        content: [
          '「スズキ株式会社（Suzuki）」、「株式会社エムスクエア・ラボ（m2labo）」とコラボし、MobileMoverを開発'
        ]
      },
      {
        date: '2023/03',
        content: ['「株式会社CuboRex」とコラボし、取引の代理を行う']
      },
      {
        date: '2023/07',
        content: ['「株式会社雨風太陽」と業務連携し、ポケットマルシェのデザインを受託']
      }
    ]
  },
  work: {
    project_types: {
      all: '全て',
      planning: '企画発想とイベント実行',
      system: 'システム設計 / 開発と運用',
      trading: '国際貿易サービス',
      product: 'プロダクトデザイン',
      design: 'グラフィックデザイン'
    },
    vegibus: {
      name: '生産・販売統合システム｜日本農産のBtoB物流サービス',
      detail: {
        tags: ['#システム開発', '#フロントエンド開発', '#ウェブデザイン'],
        paragraph: `農産品流通日本企業「やさいバス（Vegibus）」と連携し、地産地消の持続可能な供給を推進しています。やさいバスシステムでは、生産地の供給、配送状況、注文と支払い情報を一元化し、複雑な物流プロセスにおいて、複数の農家からの商品受け取り、集荷、沿線での配送を効率的に実現しました。
                現在では、日本の静岡県、茨城県、千葉県、大阪府などで地域の農産物流通ネットワークを構築し、消費者が高鮮度な野菜や果物を楽しむことができるだけでなく、地域食品生産に対する友好的で持続可能な関係を築いています。`
      }
    },
    mobile_mover: {
      name: 'ロボット台車開発｜自動移動ロボットの操作インタフェース',
      detail: {
        tags: ['#組み込みシステム開発', '#フロントエンド開発', '#ウェブデザイン'],
        paragraph: `モバイルムーバー（Mobile Mover）は、屋外作業用のモビリティです。高齢化による農業労働力の急激な減少という地域の課題に対処するため、エムスクエア・ラボとスズキが共同で開発し、操作インタフェースを琥白に依頼しました。
                操作方法は、ジョイスティック式、有線追尾式、リモコン式の3つのパターンがあります。スズキの高度な電動車椅子の走行技術による安定した足回りと高い耐環境性により、荷物の搬送や乗車だけでなく、防除などの農作業にも応用することができます。`,
        description: {
          desc_1: `モバイルムーバーアプリは、農業機械にタスクスケジュール、ルート、実行内容を設定し、実行中に車両の作業状況をリアルタイムで監視することができます。`,
          desc_2: `田畑での操作を考慮し、モバイルムーバーは移動デバイス向けに開発されており、タブレットで制御し、インタフェースからジョイスティックで操作できます。`,
          desc_3: `車両の実行ルート、状態、電力、速度、位置の報告に対して、車両をリアルタイムで監視することができます。複数の地図上の複数のルートを管理し、田畑の管理作業内容をもっと簡単にし、柔軟にタスクのルートを計画することができます。そしてユーザーは異なる任務の要件に応じて、ルートを設定、編集、保存することができ、標準化された作業内容を作成できます。`
        }
      }
    },
    woodworking_book: {
      name: 'ブックデザイン｜木工技術の本',
      detail: {
        tags: ['#ブックデザイン', '#グラフィクデザイン', '#イラストデザイン'],
        paragraph: `国立台湾工芸研究開発センターとコラボし、職人にいる現場を実際に伺い、機械操作の映像や口述の情報を収集しました。そして職人の50年間の技術の粋をこの本にまとめ、政府の出版物として出版しました。
                国家書店政府出版品のリンク：<a style='color: hsla(38, 76%, 60%, 1);text-decoration: none;' href='https://www.govbooks.com.tw/books/137952' target='_blank'>https://www.govbooks.com.tw/books/137952</a>`
      }
    },
    mu_maison: {
      name: '家具デザイン｜慕廂－優雅で可動性を備えた実木家具',
      detail: {
        tags: ['#家具デザイン', '#プロダクトデザイン'],
        paragraph:
          '現代の居室やオフィスの柔軟性や共有性に対する要求に応えるために、慕廂は実木家具のコンパクトさに重点を置き、組み立てよりたたむことを重視していました。テーブル、椅子、サイドボードのたたむデザインに通じ、優雅で簡単な移動を実現しました。',
        description: {
          desc_1: `どんな道具も必要なしに設置できる・3つの簡単なステップ`,
          desc_2: `慎重に選ばれた高品質な木材を使用して、職人の技術力を合わせ、そしてエルム材の強靭な性質が曲線構造に活かされ、松材の柔らかさが繊細なテーブルトップと調和しています。デスクの革張りの表面は、長時間のキーボード操作、マウスの使用、筆記に対して絶対的な快適さを提供します。`,
          desc_3: `デスクトップを折りたたみ、座席を近づけ、3つの家具の部品を分解せずにセットとして収納できます。堅木製の家具本体の収納により、空間の優雅な変身、楽な配置、即座の生産性再開が可能です。`
        }
      }
    },
    leek_kimchi: {
      name: 'パッケージデザイン｜ニラキムチ',
      detail: {
        tags: ['#パッケージデザイン', '#グラフィックデザイン'],
        paragraph:
          '農家の地産地消の利点を活かし、ニラの漬け物特産品の開発を支援し、パッケージデザインを提案しました。これにより、農産物の加工付加価値を向上させることができます。'
      }
    },
    hiroshima_station: {
      name: '商業空間｜広島三原駅の無人八百屋',
      detail: {
        tags: ['#空間デザイン', '#視覚デザイン'],
        paragraph:
          'JR西日本の地域の駅に設置された無人店舗は、陳列設備、空間、店内の視覚的一貫性を調整し、快適さと実用性のバランスを兼ね備え、自由で便利なショッピング体験を提供しました。'
      }
    },
    takahata_business_card: {
      name: 'グラフィックデザイン｜高畠町役場名刺デザイン',
      detail: {
        tags: ['#名刺デザイン', '#グラフィックデザイン'],
        paragraph:
          '正面のロゴは市内の国家重要文化財である「旧高畠駅」と結びつき、裏面のエレガントなテクスチャーは特産品である「高畠石」から取り入れました。地域の風情に囲まれた細部のディテールは、基層機関と地域のつながりを強化し、初対面の名刺交換により多くの驚きと話題があるようにデザインしました。'
      }
    },
    m2labo_business_card: {
      name: 'グラフィックデザイン｜M2Labo 名刺デザイン',
      detail: {
        tags: ['#名刺デザイン', '#グラフィックデザイン'],
        paragraph:
          '鮮やかな朝陽と夕陽は日本の国旗を象徴し、両面のイメージは企業が日の出から始まり、日没まで努力を惜しまない精神を表しています。'
      }
    },
    pineapples: {
      name: '国際貿易｜屏東県の金鑽パイナップルを日本へ輸出',
      detail: {
        tags: ['#国際貿易', '#輸出サービス'],
        paragraph:
          '台湾屏東県の「緑地農特産品生産協同組合」と農産販売日本物流企業「やさいバス」の連携を図り、台湾パイナップルを一番新鮮な状態で日本の地元スーパーマーケットカスミに直接供給しました。これは民間による農産品の輸出革新であり、農家から直接消費者への配送により、製品の新鮮さと価格競争力が大幅に向上し、輸出経路を短縮によって、農民の収益も増やしました。また、日本の人々も鮮度がより高い、そしてより手頃な価格で台湾パイナップルを楽しむことができます。'
      }
    },
    lathe_machine_workshop: {
      name: 'イベント企画｜木工旋盤技術の研究ワークショップ',
      detail: {
        tags: ['#イベント記録', '#映像編集', '#シナリオプランニング'],
        paragraph: `国立台湾工芸研究開発センターとコラボし、現地で映像や口述の情報を収集し、職人の50年間の技術の精華を記録させていただきました。映像編集や映像記録は、活動終了日に上映され、活動の締めくくりとして使用されていました。
                旋盤のイベント記録のリンクはこちら：<a style='color: hsla(38, 76%, 60%, 1);text-decoration: none;' href='https://youtu.be/fygtvFBfvxU' target='_blank'>https://youtu.be/fygtvFBfvxU</a>`
      }
    }
  },
  services: {
    system: {
      name: 'システム設計 / 開発と運用',
      slogan: [
        'お客様の要望によって、システム構築し、',
        '将来の展望を築くためのサポートを提供いたします'
      ],
      description:
        'SaaS（Software as a Service）のソフトウェアサービスから、お客様のご要件に応じて最適なシステムを構築し、業務プロセスを効率化いたします。',
      content: [
        {
          title: 'システム開発',
          services: [
            {
              subtitle: 'フロントエンド',
              items: [
                'フロントエンドフレームワーク',
                'インタラクションデザイン',
                'RWD レスポンシブ・ウェブ・デザイン',
                'プログレッシブウェブアプリケーション (PWA)'
              ]
            },
            {
              subtitle: 'バックエンド',
              items: [
                'データベース設計',
                'API 開発 / サードパーティAPIの接続',
                'クラウドインテグレーションデプロイ',
                'CI / CD'
              ]
            }
          ]
        },
        {
          title: 'データ分析',
          services: [
            {
              subtitle: 'ビジネスデータ分析',
              items: ['データ分析', 'BI ツールの投入', 'データ収集・転移、ロード自動化']
            }
          ]
        },
        {
          title: '受託開発',
          services: [
            {
              subtitle: '組み込みシステム開発',
              items: ['IoT（モノのインターネット）開発']
            }
          ]
        }
      ],
      works_example: [
        '生産・販売統合システム｜日本農産のBtoB物流サービス',
        'ロボット台車開発｜自動移動ロボットの操作インタフェース'
      ]
    },
    trading: {
      name: '国際貿易サービス',
      slogan: ['台湾の美味しい食文化の発掘し', '国際を向けて歩み出す'],
      description:
        '台湾と日本の農産物および食品の双方向の供給と販売、さらに農業機械の代理サービスを提供し、MIT(Made in Taiwan)を世界に立ち上げるように、対象國の輸入輸出の商品相談 / 消費習慣に合わせたブランドパッケージ作成 / 輸出代行などのサービスを提供しています。',
      content: [
        {
          title: '輸入輸出  / 国際貿易',
          services: [
            {
              subtitle: '輸出入シングルウィンドウサービス',
              items: [
                '輸入輸出の商品相談',
                '対象國の消費習慣の調査',
                'マーケティングプランの立ち上げ',
                '中国語 / 英語 / 日本語の窓口',
                '対象國に向けてブランドパッケージの作成'
              ]
            }
          ]
        }
      ],
      works_example: ['国際貿易｜屏東県の金鑽パイナップルを日本へ輸出']
    },
    product: {
      name: 'プロダクトデザイン',
      slogan: [
        '既存の製品の問題点を突き込んで',
        '世の中の動向やトレンドを把握しつつ、斬新なデザインで痛点を解消していく'
      ],
      description: 'ユーザー視点から機能と形を考え、繊細なデザインで製品を仕上げていきます。',
      content: [
        {
          title: '製品開発',
          services: [
            {
              subtitle: '研究開発とデザインサービス',
              items: [
                '要件まとめ',
                'コンセプト提案',
                '競合商品の研究',
                'プロダクトデザイン',
                '3Dモデル作成',
                'プロダクト・立体制作'
              ]
            }
          ]
        }
      ],
      works_example: ['家具デザイン｜慕廂－優雅で可動性を備えた実木家具']
    },
    design: {
      name: 'グラフィックデザイン',
      slogan: ['一つのデザインで、お客様の商品の魅力を作り出して', 'ブランドの可能性を呼び起こす'],
      description: 'お客様の目指している目標や改善したい事にデザインをかけて、形にしていきます',
      content: [
        {
          title: 'ビジネスデザイン',
          services: [
            {
              subtitle: '視覚デザイン',
              items: [
                'ブランディングデザイン',
                'ブックデザイン',
                'グラフィックデザイン',
                'パッケージデザイン・制作',
                'UI / UXデザイン'
              ]
            }
          ]
        }
      ],
      works_example: ['パッケージデザイン｜ニラキムチ', 'グラフィックデザイン｜M2Labo 名刺デザイン']
    },
    planning: {
      name: '企画発想とイベント実行',
      slogan: ['様々の分野からの人材で、', 'お客様のいろんな発想を輝かしく'],
      description:
        'お客様の要望によって、外部のチームとコラボし、研修、イベント、展示会に対するのサービスを提供しております。',
      content: [
        {
          title: '企画活動',
          services: [
            {
              subtitle: '企画発想と活動計画',
              items: [
                '研修、イベント、展示会の計画',
                'コンテンツ企画',
                '実行統括',
                '現場の司会と場務',
                'イベントの視覚デザインとメディア代行'
              ]
            }
          ]
        }
      ],
      works_example: ['イベント企画｜木工旋盤技術の研究ワークショップ']
    }
  },
  member: {
    charles: {
      name: '凱元 Charles',
      position: '最高経営責任者',
      description: '水瓶座のロジック',
      skills: [
        '食農供給チェーン',
        'ヒューマンインタラクション',
        'インターナショナルプランニング',
        'システムデザイン'
      ],
      intro: ``
    },
    hannah: {
      name: '詩涵 Hannah',
      position: 'フルスタックエンジニア',
      description: 'あなたの質問をサプライズに！',
      skills: ['Web ベース アーキテクチャ設計', 'プロジェクト管理と品質管理', 'データ分析と可視化'],
      intro: ``
    },
    arthur: {
      name: '柏維 Arthur',
      position: 'フルスタックエンジニア',
      description: '文科と理系のデュアルシステム',
      skills: [
        'Web APIの構築と設計',
        'ハードウェアとソフトウェアの開発',
        'ロボットオペレーティングシステム'
      ],
      intro: ``
    },
    albert: {
      name: '書彥 Albert',
      position: 'フルスタックエンジニア',
      description: 'ユニコーン愛好者',
      skills: [
        'サーバーの構成',
        'サイトパフォーマンス最適化',
        'データベースの設計',
        '情報セキュリティ',
        'AI導入'
      ],
      intro: ``
    },
    lily: {
      name: '子涵 Lily',
      position: 'ハードウェアエンジニア',
      description: 'ボール打ってるか、コード打ってるんだ',
      skills: [
        'エンベデッドシステム開発',
        'ハードウェアアーキテクチャ設計',
        'ハードウェア環境の互換性評価'
      ],
      intro: ``
    },
    jozie: {
      name: '趯瑾 Jozie',
      position: 'フロントエンドエンジニア',
      description: 'インディーロック探究者',
      skills: [
        'フロントエンドフレームワーク開発',
        'テンプレートサイト構築とカスタマイズサイト構築',
        'データ可視化とインタラクションデザイン',
        'SEO 最適化'
      ],
      intro: ``
    },
    arien: {
      name: '采蘋 Arien',
      position: 'グラフィックデザイナー',
      description: 'デザインの永久機関',
      skills: [
        'ユーザー研究',
        'Webサイト全体像と計画',
        'ユーザインタフェース設計',
        'ブランドデザイン',
        'グラフィックデザイン'
      ],
      intro: ``
    },
    ivy: {
      name: '逸青 Ivy',
      position: 'グラフィックデザイナー',
      description: '発想源はコーヒーカップの底にある',
      skills: [
        'ブランドデザイン',
        'パーティシパトリーデザイン',
        'コンセプト共創',
        'ビジュアルデザイン',
        'イラストデザイン'
      ],
      intro: ``
    },
    lishin: {
      name: '立心 Lishin',
      position: 'プロダクトデザイナー',
      description: '最終確定版.final.final.3dm',
      skills: [
        'プロダクトデザイン',
        '3Dモデリングとレンダリング',
        '模型製作',
        'Rhinoceros 3D',
        'KeyShot'
      ],
      intro: ``
    },
    brooke: {
      name: '采倫 Brooke',
      position: 'コンテンツ企画',
      description: 'デザインを南極まで！',
      skills: ['サービスデザイン', 'データプランニング', 'コンテンツ企画', 'イベント実行'],
      intro: ``
    },
    andrew: {
      name: '俊宇 Andrew',
      position: 'ソフトウェアエンジニア',
      description: '創造力を抱く',
      skills: [
        'ヒューマンインタラクション',
        'スペースコンピューティング',
        'コンピュータグラフィックス',
        'プロダクトデザイン'
      ],
      intro: ``
    },
    ti: {
      name: '彩緹 Ti',
      position: 'ビジネス開発',
      description: '変わった可愛さ、そして真面目',
      skills: [
        'プロポーザルとプレゼンテーション',
        'コールドコール',
        '企画立案と実行',
        '製品の説明と紹介'
      ],
      intro: ``
    }
  },
  contact: {
    introduction: {
      title: `どんな要望でも大歓迎！`,
      description: `私たちにお気軽にお問い合わせください。
      ご要望やりクエスト等ございましたら、
      下記フォームにご記入いただき、
      担当者よりご連絡いたします。`
    },
    form: {
      project_type: 'プロジェクトタイプ',
      project_types: {
        system: 'システム設計 / 開発と運用',
        design: 'グラフィックデザイン',
        content: '企画発想とイベント実行'
      },
      budget: '予算',
      estimated_project_time: 'プロジェクト予定期間',
      project_content_overview: '内容説明',
      contact_person: '担当者',
      company_brand_name: '会社名',
      contact_number: '電話番号',
      contact_email: 'メールアドレス',
      validation: {
        required: '入力されていません',
        mail_format: 'メールアドレスが正しくありません'
      }
    },
    popup: {
      confirm_submit: '確認送信',
      submit_form_confirmation: 'フォームを送信してもよろしいですか？',
      thank_you: 'ありがとうございます！',
      form_confirmation_message:
        'ご返信を受け取りました。入力された連絡先のメールアドレスに確認メールを送信します。'
    }
  }
}
export default locale
