const locale = {
  global: {
    buttons: {
      next: '次へ',
      prev: '前へ',
      back: '戻る',
      close: '閉じる',
      submit_form: '送信する',
      contact_us: 'お問い合わせ',
      view_more: '詳しく見る'
    },
    project_types: {
      system: 'システムデザインとフルスタック開発',
      design: 'ビジネスデザインとプロトタイプ製作',
      content: 'コンテンツデザインとイベントコーディネーション'
    },
    footer: {
      address: '（803）臺灣高雄市鹽埕區大勇路11號3樓'
    }
  },
  home: {
    title: {
      name: 'デザイン主導の持続可能性',
      slogan: 'Design for Nature',
      text: [
        '私たちは食農、工芸、地域の問題に取り組んでおり、',
        '社内のデザイン研究とエンジニアリングチームによって、持続可能性への無限の可能性を実現し続けています。'
      ]
    },
    about: {
      name: '琥白',
      brand: 'Kohaku Studio',
      text: `琥珀（コハク）は、天然樹脂の化石であり、宝石である。すべての生命をやさしく包み込めて、輝かしいタイムカプセルになっていく

      白は、余白の美を導く白であり、余韻を感じられるように、私たちのデザインで道を開く`
    },
    service: {
      text: '革新的な概念はスタートラインに立つ準備はできましたか？琥白があなたのビジョンを着実に実現するお手伝いをします！',
      steps: [
        {
          title: '要件調査',
          text: '要件を深く理解し、フィールド、ユーザー、現実のシナリオを調査して、課題の核心を見つけます。これらの洞察に基づいて、あなたに最適な解決策を提供します。'
        },
        {
          title: 'コンセプトデザイン',
          text: 'この段階では、アイデア出し、魅力的なプロトタイプの構築、そしてこれらのアイデアが本当に目標達成に貢献するように継続的に改良します。'
        },
        {
          title: '実現への展開',
          text: 'これからは計画を実行する時です！私たちはデジタル技術を統合し、コンセプトが完璧に具現化されるようにフルスタックエンジニアリングのサービスを提供します。'
        }
      ]
    },
    solution: [
      {
        title: 'システムデザインとフルスタック開発',
        text: ['情報システムのカスタマイズと産業導入', 'デジタル製品サービスのフルスタック開発'],
        keywords: [
          'フロントエンド開発',
          'バックエンド統合',
          'ビジネスデータマイニング',
          'ソフトウェアおよびハードウェア統合デザイン',
          'アプリケーション開発'
        ]
      },
      {
        title: 'ビジネスデザインとプロトタイプ製作',
        text: ['美学を通じて洗練されたブランドイメージの構築で', 'ビジョンを伝える'],
        keywords: [
          'ビジネスビジュアルデザイン',
          '企業アイデンティティシステム',
          '展示スペースデザイン',
          'インターフェースとインタラクションデザイン',
          'ミクストメディアと製品デザイン'
        ]
      },
      {
        title: 'コンテンツデザインとイベントコーディネーション',
        text: [
          'デザイン研究と持続可能性を中心に据え',
          '実質的な利益を重視する戦略的なクリエイティビティ'
        ],
        keywords: [
          '持続可能性と循環型事業計画',
          'サービスとエクスペリエンスデザイン',
          'カリキュラムとイベントデザイン',
          '展示企画と実行',
          'デジタル変革と再構築'
        ]
      }
    ],
    contact: {
      title: '最初のお問い合わせから始め、持続可能な無限の可能性を広げましょう！',
      text: `→ アイデアがありますか？教えてください！
      → 予算がありますか？おまかせください！
      → 目標がありますか？一緒に実現しましょう！`
    }
  },
  about: {
    description: {
      introduction: `琥白（コハク）の物語は、2021と2022の間に、
            分野横断の若者達から始まりました
            故郷に期待を持っているこそ、台湾で根を下ろした
            社会に希望を持っているこそ、基盤産業に力を注いでいる`,

      mission_values: `文化の美しいところを広める以外に
            イノベーションを産業に打ち込んで
            情報工学とデザインの力で地域と国際を繋げていく

            事業計画からマーケティング
            デザインから開発
            産地から世界
            伝統から革新

            分野横断な思考を基点として
            サプライチェーンの点と点を繋げていく
            様々な分野でイノベーションを起こす
            風立ちぬ`
    },

    brand: {
      name: '琥白 Kohaku',
      text: `琥珀（コハク）は、天然樹脂の化石であり、宝石である。すべての生命をやさしく包み込めて、輝かしいタイムカプセルになっていく

            白は、余白の美を導く白であり、余韻を感じられるように、私たちのデザインで道を開く`
    },

    milestone: [
      {
        year: 2021,
        title: '創造能力の起動',
        events: [
          {
            name: '日系資金の投資により、創次方株式会社が創設され、カスタマイズされたソフトウェアおよびハードウェアシステムの開発を中心に発展'
          },
          { name: '高雄に拠点を設立' },
          { name: '日本会社やさいバス　システム開発およびメンテナンス　受託' }
        ]
      },
      {
        year: 2022,
        title: '工芸分野に展開',
        events: [
          {
            name: '台湾最大のイノベーションおよび起業競技会であるU-Startからの資金注入により、琥白株式会社を創設、コンテンツおよびデザインを中心に発展'
          },
          { name: '台北に拠点を設立' },
          {
            name: '「スズキ株式会社」、「株式会社エムスクエア・ラボ」とコラボし、小型移動車制御ソフトウェアおよびサービスの開発を開始'
          },
          {
            name: '国立台湾工芸研究センターのプロジェクト　受託',
            detail: [
              '木工の基本ツール操作に関する黄俊傑氏の著書「木工基本機具操作工具書」を出版',
              '車床技術の研究ワークショップの活動を記録'
            ]
          }
        ]
      },
      {
        year: 2023,
        title: '台湾に根付く',
        events: [
          { name: '日本からの出資を取り戻し、創次方は完全な台湾企業となる' },
          { name: '日本のアグリプロデュースからの委託により、食品デザインの業務を開始' },
          {
            name: '国立台湾工芸研究センターのプロジェクト　受託、「工藝基因」データベースの構築を開始'
          },
          { name: '泛科知識株式会社と協力し、国立成功大学での農業創造講座の設計と技術顧問　受託' },
          {
            name: '日本のチェーンスーパーマーケットで「台湾ブース」を立ち上げ、台湾農協製品を厳選して販売'
          },
          {
            name: '桃園市立大溪木工生態博物館のプロジェクト　受託、木工職人の研究と内容の再解釈を進める'
          },
          {
            name: '財団法人台湾バナナ研究所からの海外販売プロジェクト　受託、日本のスーパーでの販売ブースを設置と宣伝'
          },
          { name: '高雄のスマート農業補助計画の受賞を受け、一式噴藥搬運自走車の開発を開始' },
          {
            name: '創次方株式会社が高雄 SBIR からの資金注入を受け、持続可能な食農サプライチェンの前期研究を開始'
          },
          {
            name: '綠冠有機農場とコラボし、イノベーションパイナップルファイバーテクノロジーの産業応用の窓口を担当'
          },
          { name: '日本のユーアイシステムズからのシステム設計　受託' },
          {
            name: '「株式会社エムスクエア・ラボ」とコラボし、NTT西日本からのシステム設計プロジェクト　受託'
          },
          { name: '承億グループとコラボし、高雄の承億酒店にオフィスを設立' }
        ]
      }
    ]
  },
  work: {
    project_types: {
      all: '全て',
      system: 'システムデザインとフルスタック開発',
      design: 'ビジネスデザインとプロトタイプ製作',
      content: 'コンテンツデザインとイベントコーディネーション',
      placeholder: '選択してください'
    },
    projects: {
      1: {
        name: '持続可能性と循環計画｜小型農業自走車',
        content: `日本の自動車企業とコラボし、農業労働力の高齢化に対処するため、小型農業自走車両のユーザーエクスペリエンスデザインを提案しました。設計プロセスでは、農業の作業の多様性、農家に適した簡単で直感的な操作フローとインターフェースを考慮し、環境に持続可能なハードウェア資材を評価しました。`,
        keywords: ['エクスペリエンスデザイン', 'サービスデザイン ', '企業イメージポジショニング']
      },
      2: {
        name: 'カリキュラムとイベントデザイン｜技術農業ワークショップ',
        content: `労働力開発署南方創客基地との協力で、農業領域を対象に、「スマートトレード」、「スマートマネージメント」、「スマートプロダクション」という3つのテーマのシリーズコースを計画しました。全体のイベントは1か月間にわたり、参加者をデザイン思考、技術実践、ビジネス応用の全方位に導き、ソフトウェアおよびハードウェアデバイスの統合的な応用を実現しました。`,
        keywords: ['課程デザイン', 'イベントプランニング', '技術指導', 'デザイン思考']
      },
      3: {
        name: 'カリキュラムとイベントデザイン｜木工旋盤技術の研究ワークショップ',
        content: `国立台湾工芸研究開発センターとコラボし、現地で映像や口述の情報を収集し、職人の50年間の技術の精華を記録させていただきました。映像編集や映像記録は、活動終了日に上映され、活動の締めくくりとして使用されていました。

        旋盤のイベント記録のリンクはこちら：https://youtu.be/fygtvFBfvxU`,
        keywords: ['イベント記録', '映像編集', 'シナリオプランニング']
      },
      4: {
        name: 'デジタル変革と再構築｜工芸学習プラットフォーム',
        content: `国立台湾工芸研究開発センターとコラボし、総合的な工芸学習プラットフォームの計画が進められました。この取り組みは、オンラインとオフラインの工芸学習、展示イベント、プロジェクトリソースを統合しています。プロセス全体で、複数のユーザーの機能的な権限とウェブサイトの使用フローに対する検討が行われ、工芸の本質が直感的に伝えられるようになっています。`,
        keywords: [
          'サービスデザイン',
          'プロセスプランニング',
          'インターフェースデザイン',
          'イベントプランニング'
        ]
      },
      5: {
        name: '展示スペースデザイン｜CEATEC＆農業WEEK',
        content: `2022年のCEATECおよび2023年の農業WEEKの展示会で、日本の企業と協力してブースデザインを行いました。展示の目的を明確にし、展示される商品を深く理解し、情報が溢れる展示会場で来場者の注目を引く方法を考え、出展企業と展示商品の価値を正確に伝えます。`,
        keywords: ['空間デザイン', '展示会デザイン', 'DMデザイン']
      },
      6: {
        name: '展示スペースデザイン｜スーパー＆日本新幹線駅',
        content: `JR西日本の地域の駅に設置された無人店舗は、陳列設備、空間、店内の視覚的一貫性を調整し、快適さと実用性のバランスを兼ね備え、自由で便利なショッピング体験を提供しました。`,
        keywords: ['空間デザイン', '視覚デザイン']
      },
      7: {
        name: '農産物の輸出｜屏東県の金鑽パイナップルを日本へ輸出',
        content: `台湾屏東県の「緑地農特産品生産協同組合」と農産販売日本物流企業「やさいバス」の連携を図り、台湾パイナップルを一番新鮮な状態で日本の地元スーパーマーケットカスミに直接供給しました。これは民間による農産品の輸出革新であり、農家から直接消費者への配送により、製品の新鮮さと価格競争力が大幅に向上し、輸出経路を短縮によって、農民の収益も増やしました。また、日本の人々も鮮度がより高い、そしてより手頃な価格で台湾パイナップルを楽しむことができます。`,
        keywords: ['国際貿易', '輸出サービス']
      },
      8: {
        name: 'ミクストメディアと製品デザイン｜慕廂－優雅で可動性を備えた実木家具',
        content: `現代の居室やオフィスの柔軟性や共有性に対する要求に応えるために、慕廂は実木家具のコンパクトさに重点を置き、組み立てよりたたむことを重視していました。テーブル、椅子、サイドボードのたたむデザインに通じ、優雅で簡単な移動を実現しました。`,
        keywords: ['家具デザイン', 'プロダクトデザイン']
      },
      9: {
        name: 'ミクストメディアと製品デザイン｜セラミックス廃材再生カップ&テーブル椅子セット',
        content: `国立台湾工芸研究開発センターとコラボし、セラミックス廃材を活用し、異なるセラミックス廃材の材料組成がもたらす独特の模様と質感を活かして、紙フィルター不要のコーヒーセラミックフィルターカップ「淳次（Puffer）」、手のひらにフィットする器「沉次（Paltain）」、循環可能性を象徴するテーブルと椅子「方角（Posible）」を開発し、循環材料に新しい姿をもたらしました。`,
        keywords: ['サステナブルデザイン', '再生材料', '製品デザイン', '製品製作']
      },
      10: {
        name: 'ビジネスビジュアルデザイン｜木工技術の本',
        content: `国立台湾工芸研究開発センターとコラボし、職人にいる現場を実際に伺い、機械操作の映像や口述の情報を収集しました。そして職人の50年間の技術の粋をこの本にまとめ、政府の出版物として出版しました。

        国家書店政府出版品のリンク：https://www.govbooks.com.tw/books/137952`,
        keywords: ['ブックデザイン', 'グラフィクデザイン', 'イラストデザイン']
      },
      11: {
        name: 'ビジネスビジュアルデザイン｜日本会社名刺デザイン',
        content: `鮮やかな朝陽と夕陽は日本の国旗を象徴し、両面のイメージは企業が日の出から始まり、日没まで努力を惜しまない精神を表しています。Ｆ`,
        keywords: ['名刺デザイン', 'グラフィックデザイン']
      },
      12: {
        name: 'ビジネスビジュアルデザイン｜高畠町役場名刺デザイン',
        content: `正面のロゴは市内の国家重要文化財である「旧高畠駅」と結びつき、裏面のエレガントなテクスチャーは特産品である「高畠石」から取り入れました。地域の風情に囲まれた細部のディテールは、基層機関と地域のつながりを強化し、初対面の名刺交換により多くの驚きと話題があるようにデザインしました。`,
        keywords: ['名刺デザイン', 'グラフィックデザイン']
      },
      13: {
        name: 'ブランドイメージ識別｜朝食・夜食店のグラフィックデザイン',
        content: `高雄の地元の朝食・夜食店との協力により、テーマとしての「元宝」と店名の「妤」を取り入れ、全体的な「豊かさ」や「鮮やかさ」のスタイルに合わせ、「圓飽生財 金魚游泳（豊かなるものは円満なるもの）」のデザインコンセプトを提案します。店内のさまざまなニーズを考慮して、応用できる素材をデザインします。`,
        keywords: ['ロゴデザイン', 'メニューデザイン', '看板デザイン', '企業イメージポジショニング']
      },
      14: {
        name: 'ブランドイメージ識別｜ニラキムチのパッケージデザイン',
        content: `日本の高級スーパーで販売されており、地産地消の優位性を生かして、農家がニラキムチの特産品を製造するプロセスをサポートし、上架基準に適したパッケージを設計して、農産品の加工付加価値を高めています。`,
        keywords: ['パッケージデザイン', 'ビジュアルデザイン']
      },
      15: {
        name: '生産・販売統合システム｜日本農産のBtoB物流サービス',
        content: `農産品流通日本企業「やさいバス（Vegibus）」と連携し、地産地消の持続可能な供給を推進しています。やさいバスシステムでは、生産地の供給、配送状況、注文と支払い情報を一元化し、複雑な物流プロセスにおいて、複数の農家からの商品受け取り、集荷、沿線での配送を効率的に実現しました。

        現在では、日本の静岡県、茨城県、千葉県、大阪府などで地域の農産物流通ネットワークを構築し、消費者が高鮮度な野菜や果物を楽しむことができるだけでなく、地域食品生産に対する友好的で持続可能な関係を築いています。`,
        keywords: ['システム開発', 'フロントエンド開発', 'ウェブデザイン']
      },
      16: {
        name: 'ロボット台車開発｜自動移動ロボットの操作インタフェース',
        content: `高齢化した農村労働力の不足や農業の緻密な管理などに対応するため、スマート農業機械を将来の解決策として採用し、作物の管理サイクルに合わせて草の圧迫、雑草の除去、散布、収穫および搬送など、全機能の農業サポートを実現します。農業機械と電子機器の統合技術は、農場地域モデルの構築、地図上の経路分析、使いやすいモバイル操作システムを考慮し、高齢者農家向けに適応したシステムの変革サービスフローを設計し、経営負担を軽減します。`,
        keywords: ['組み込みシステム開発', 'フロントエンド開発', 'ウェブデザイン']
      },
      17: {
        name: '注文を素早く取り込むツール｜KOKO BOT',
        content: `LINEは友達とのコミュニケーションだけでなく、多くの生鮮品小売業者やレストランにとって注文の便利な手段です。しかし、日常のLINEを使用した注文プロセスは、体系的に統計を取ることができないため、双方が手動で「注文整理」や「金額の合算」を行う手間がかかります。琥白が開発したKOKO LINEは、3つのステップで日常業務の30分を節約できます！`,
        keywords: ['ツール開発', 'インターフェースデザイン']
      },
      18: {
        name: 'クラウドベースの販売ツール｜KOKO SCALE',
        content: `伝統的な市場のはかりは重量と金額しか計測できず、その後は手動で当日の販売情報を記録し、集計し、製品ラベルを印刷する必要があり、当日の販売記録を明確に把握することができません。また、販売プロセスでは販売総額を一つ一つ計算する手間もかかります。琥白が開発したKOKO SCALEは、クラウドとBluetoothを活用して市場の販売データを管理します！`,
        keywords: ['ツール開発', 'インターフェースデザイン']
      },
      19: {
        name: 'ビジネスビジュアルデザイン｜琥白名刺デザイン',
        content: `琥白股份有限公司の名刺デザイン。琥白の部分的な光沢のある輪郭は、立方体が円体に磨かれるプロセスを表しており、琥白の専門的な磨き作業を経て最終的には輝く琥珀に変わることを象徴しています。`,
        keywords: ['名刺デザイン', 'グラフィックデザイン']
      }
    }
  },
  services: {
    tool_title: 'カスタム開発ツール',
    example_title: 'Work',
    system: {
      title: 'システムデザインとフルスタック開発',
      text: 'ソフトウェア・アズ・ア・サービス（SaaS）を出発点に、お客様のニーズに合わせた業界システムのカスタマイズおよびクロスシステムの統合サービスを提供しています。システムと端末デバイスを統合し、意思決定のためのデータ収集を支援し、供給と流通の効率を向上させるためにプロセスを最適化します。',
      items: [
        {
          title: 'フロントエンドデザインと開発',
          list: [
            'フロントエンドフレームワークの開発',
            'フロントエンドインタラクションデザイン',
            'レスポンシブウェブデザイン（RWD）'
          ]
        },
        {
          title: 'バックエンド統合とデプロイ',
          list: [
            'データベースの設計と計画',
            'APIの開発 / サードパーティAPIの統合',
            'クラウドアーキテクチャの設計',
            'CI / CD',
            'CMSの開発'
          ]
        },
        {
          title: 'アプリケーション開発',
          list: [
            'プログレッシブウェブアプリケーション（PWA）',
            'クロスプラットフォーム（ハイブリッド）アプリケーション開発'
          ]
        },
        {
          title: 'ビジネスデータマイニングと分析',
          list: [
            'ビジネスデータの分析と可視化',
            'BIツールの実装',
            'データ収集、転送、および読み込みの自動化'
          ]
        },
        {
          title: 'ソフトウェアとハードウェアの統合設計',
          list: ['IoTデバイスの開発', '組み込みシステム']
        }
      ],
      tools: [
        {
          title: 'フロントエンドフレームワーク',
          list: ['Vue', 'React', 'jQuery']
        },
        {
          title: 'フロントエンドUIフレームワーク',
          list: ['Vuetify', 'PrimeVue', 'BootstrapVue']
        },
        {
          title: 'フロントエンドインタラクションおよび可視化',
          list: ['D3.js', 'p5.js', 'Three.js', 'Chart.js']
        },
        {
          title: 'サーバーサイド開発ツール',
          list: ['Python', 'Flask', 'Django', 'NodeJS']
        },
        {
          title: 'データベース開発',
          list: ['MySQL', 'PostgreSQL', 'MongoDB']
        },

        {
          title: 'API 開発',
          list: ['カスタムAPI開発', '支払い/物流APIとの統合', 'ERP/CRM APIとの統合']
        },
        {
          title: 'アプリ開発',
          list: ['React Native 開発 (Hybrid)', 'Ionic 開発 (Hybrid)']
        },
        {
          title: 'クラウドアーキテクチャのデプロイ',
          list: ['Amazon Web Services (AWS)']
        },
        {
          title: 'デプロイツール',
          list: ['Docker']
        },
        {
          title: 'ウェブサイトデータ分析ツール',
          list: ['Google Analytics']
        },
        {
          title: 'サードパーティアプリケーション開発',
          list: ['LINE BOT', 'Google App Script']
        }
      ]
    },
    design: {
      title: 'ビジネスデザインとプロトタイプ製作',
      text: `美学の観点からアプローチし、見落とされがちな不便さを転換して、優雅な製品やサービスを魅せます。視覚的なページであろうと、パッケージのアイテムであろうと、あるいはサービス体験であろうと、それぞれがあなたのビジョンを伝えるための媒介となります。

      私たちは人とのつながりを探求し、デザインの再解釈を通じて、顧客が企業のビジョンに共感できるように、製品やサービスへの信頼を高める手助けをします。`,
      items: [
        {
          title: 'ビジネスデザイン',
          list: [
            'ブックデザイン',
            'イラストレーションデザイン',
            'グラフィックデザイン',
            'パッケージデザイン・制作'
          ]
        },
        {
          title: 'コーポレート・アイデンティティ',
          list: [
            'VI ビジュアル・アイデンティティ',
            'BI ビヘイビア・アイデンティティ',
            'MI マインド・アイデンティティ'
          ]
        },
        {
          title: 'ミクストメディアと製品デザイン',
          list: ['製品外観デザイン', '3Dモデリング', 'モデル製作', 'ミクストメディア応用']
        },
        {
          title: '展示スペースデザイン',
          list: ['空間ビジュアルデザイン', '展示ブースデザイン', '展示会場インタラクションデザイン']
        },
        {
          title: 'インターフェースとインタラクションデザイン',
          list: ['ユーザーインターフェースデザイン', 'webインタラクションデザイン']
        }
      ]
    },
    content: {
      title: 'コンテンツデザインとイベントコーディネーション',
      text: '我々のアプローチの中心には持続可能性があり、デザイン駆動の変革とデジタル戦略が補完されています。我々は画像、コミュニケーション、および体験を向上させるために、変換率とコンテンツを優先し、産業に新たな観点をもたらします。',
      items: [
        {
          title: '持続可能で循環的な企画',
          list: ['ESGーCO2排出量削減計画', '持続可能なサプライチェーン', '循環経済戦略']
        },
        {
          title: 'サービスとエクスペリエンスデザイン',
          list: ['ユーザー調査', '顧客体験', '市場およびデータ分析']
        },
        {
          title: 'カリキュラムとイベントデザイン',
          list: ['テクニカルコースの計画', 'デザインワークショップ']
        },
        {
          title: '展覧会の企画と実行',
          list: ['ブランドイメージのショーケース', '展示のインタラクティブな体験']
        },
        {
          title: 'デジタル変革と再構築',
          list: ['デジタルアーカイブと転換', 'デジタルツールの評価と実装', 'オペレーション改革']
        }
      ]
    }
  },
  member: {
    charles: {
      name: 'Charles',
      position: '最高経営責任者',
      description: '水瓶座のロジック',
      skills: [
        '食農供給チェーン',
        'ヒューマンインタラクション',
        'インターナショナルプランニング',
        'システムデザイン'
      ],
      intro: ``
    },
    hannah: {
      name: 'Hannah',
      position: '最高技術責任者',
      description: 'あなたの質問をサプライズに！',
      skills: ['Web ベース アーキテクチャ設計', 'プロジェクト管理と品質管理', 'データ分析と可視化'],
      intro: ``
    },
    arthur: {
      name: 'Arthur',
      position: 'フルスタックエンジニア',
      description: '文科と理系のデュアルシステム',
      skills: [
        'Web APIの構築と設計',
        'ハードウェアとソフトウェアの開発',
        'ロボットオペレーティングシステム'
      ],
      intro: ``
    },
    albert: {
      name: 'Albert',
      position: 'フルスタックエンジニア',
      description: 'ユニコーン愛好者',
      skills: [
        'サーバーの構成',
        'サイトパフォーマンス最適化',
        'データベースの設計',
        '情報セキュリティ',
        'AI導入'
      ],
      intro: ``
    },
    lily: {
      name: 'Lily',
      position: 'ハードウェアエンジニア',
      description: 'ボール打ってるか、コード打ってるんだ',
      skills: [
        'エンベデッドシステム開発',
        'ハードウェアアーキテクチャ設計',
        'ハードウェア環境の互換性評価'
      ],
      intro: ``
    },
    jozie: {
      name: 'Jozie',
      position: 'UX エンジニア',
      description: 'インディーロック探究者',
      skills: [
        'UX',
        'フロントエンドフレームワーク開発',
        'テンプレートサイト構築とカスタマイズサイト構築',
        'SEO 最適化'
      ],
      intro: ``
    },
    ivy: {
      name: 'Ivy',
      position: 'グラフィックデザイナー',
      description: '発想源はコーヒーカップの底にある',
      skills: [
        'ブランドデザイン',
        'パーティシパトリーデザイン',
        'コンセプト共創',
        'ビジュアルデザイン',
        'イラストデザイン'
      ],
      intro: ``
    },
    lihsin: {
      name: 'Lihsin',
      position: 'プロダクトデザイナー',
      description: '最終確定版.final.final.3dm',
      skills: [
        'プロダクトデザイン',
        '3Dモデリングとレンダリング',
        '模型製作',
        'Rhinoceros 3D',
        'KeyShot'
      ],
      intro: ``
    },
    brooke: {
      name: 'Brooke',
      position: '最高執行役員',
      description: 'デザインを南極まで！',
      skills: ['サービスデザイン', 'データプランニング', 'コンテンツ企画', 'イベント実行'],
      intro: ``
    },
    andrew: {
      name: 'Andrew',
      position: 'ソフトウェアエンジニア',
      description: '創造力を抱く',
      skills: [
        'ヒューマンインタラクション',
        'スペースコンピューティング',
        'コンピュータグラフィックス',
        'プロダクトデザイン'
      ],
      intro: ``
    },
    ti: {
      name: 'Ti',
      position: 'ビジネス開発',
      description: '変わった可愛さ、そして真面目',
      skills: [
        'プロポーザルとプレゼンテーション',
        'コールドコール',
        '企画立案と実行',
        '製品の説明と紹介'
      ],
      intro: ``
    }
  },
  contact: {
    introduction: {
      title: `伝統的な知恵を受け入れ、新しい体験を創造する`,
      description: `琥白とあなたのアイデアを共有することを歓迎します。
      私たちはあなたの小さなひらめきを輝かしい解決策に変えます！

      あなたのニーズとビジョンをお気軽にお問い合わせください。
      なるべく速やかに対応させていただきます！`
    },
    form: {
      project_type: 'プロジェクトタイプ',
      project_types: {
        system: 'システムデザインとフルスタック開発',
        design: 'ビジネスデザインとプロトタイプ製作',
        content: 'コンテンツデザインとイベントコーディネーション'
      },
      budget: '予算',
      budget_placeholder: '例：NTD. 50000',
      estimated_project_time: 'プロジェクト予定期間',
      project_content_overview: '内容説明',
      project_content_overview_placeholder: 'プロジェクト目標、初期コンセプト、参考事例',
      contact_person: '担当者',
      company_brand_name: '会社名',
      company_brand_name_placeholder: '会社/ブランドではない場合は、個人を記入してください。',
      contact_number: '電話番号',
      contact_email: 'メールアドレス',
      validation: {
        required: '入力されていません',
        mail_format: 'メールアドレスが正しくありません'
      }
    },
    popup: {
      confirm_submit: '確認送信',
      submit_form_confirmation: 'フォームを送信してもよろしいですか？',
      thank_you: 'ありがとうございます！',
      form_confirmation_message:
        'ご返信を受け取りました。入力された連絡先のメールアドレスに確認メールを送信します。'
    }
  }
}
export default locale
