const locale = {
    about: {
        description: {
            introduction: `琥白（コハク）の物語は、2021と2022の間に、分野横断の若者達から始まりました
            故郷に期待を持っているこそ、台湾で根を下ろした
            社会に希望を持っているこそ、基盤産業に力を注いでいる`,

            mission_values: `文化の美しいところを広める以外に
            イノベーションを産業に打ち込んで
            情報工学とデザインの力で地域と国際を繋げていく

            事業計画からマーケティング
            デザインから開発
            産地から世界
            伝統から革新

            分野横断な思考を基点として
            サプライチェーンの点と点を繋げていく
            様々な分野でイノベーションを起こす
            風立ちぬ`,
        },

        brand: {
            name: '琥白 Kohaku',
            meaning: `琥珀（コハク）は、天然樹脂の化石であり、宝石である。すべての生命をやさしく包み込めて、輝かしいタイムカプセルになっていく

            白は、余白の美を導く白であり、余韻を感じられるように、私たちのデザインで道を開く`,
        },

        milestone: [
            {
                date: '2021/09',
                content: [
                    '「株式会社エムスクエア・ラボ（m2labo）」、「株式会社やさいバス（Vegibus）」とコラボし',
                    '「創次方股份有限公司」を創設'
                ]
            },
            {
                date: '2022/04',
                content: ['111年文部科學省「U-start創新創業計畫」により第一段階事業補助金受賞']
            },
            {
                date: '2022/07',
                content: ['「琥白股份有限公司」を創設']
            },
            {
                date: '2022/08',
                content: [
                    '「スズキ株式会社（Suzuki）」、「株式会社エムスクエア・ラボ（m2labo）」とコラボし、MobileMoverを開発'
                ]
            },
            {
                date: '2023/03',
                content: ['「株式会社CuboRex」とコラボし、取引の代理を行う']
            },
            {
                date: '2023/07',
                content: ['「株式会社雨風太陽」と業務連携し、ポケットマルシェのデザインを受託']
            }
        ]
    }
}
export default locale