const locale = {
    about: {
        description: {
            introduction: `琥白誕生於2021與2022之間
            故事的開始是一群來自不同背景的青年
            因為期望回歸根本的初心，於是扎根於臺灣
            因為對於農業未來的想像，於是深耕於傳產`,

            mission_values: `乘載文化底蘊的同時
            也持續注入新興的能量與創意
            結合地方與國際的思維
            推動資訊與設計的揉和

            從企劃到行銷、
            從設計到開發、
            從產地到產業、
            從傳承到創新

            以跨域整合的思維
            串連起所有的端點
            匯聚不同服務的影響力
            翻轉價值`,
        },

        brand: {
            name: '琥白 Kohaku',
            meaning: `琥珀，是液態的松脂，化石化的結晶，包裹千萬年前的生命，形成動人的時光膠囊。
            白，是設計中的留白，未被填滿而包容一切的自由。

            在琥白，才能和創意自在流動，去包裹一個個初出的想法， 幾經高壓凝結成獨一無二的寶石，綻放或柔美、或奪目的輝光。 這是一處孵夢之地，邀請你一起野放天馬行空的想法，發展那些大膽的可能。`,
        },

        milestone: [
            {
                date: '2021/09',
                content: [
                    '與「株式会社エムスクエア・ラボ（m2labo）」、「株式会社やさいバス（Vegibus）」合作並獲其投資',
                    '成立「創次方股份有限公司」'
                ]
            },
            {
                date: '2022/04',
                content: ['獲111年度教育部「U-start創新創業計畫」第一階段補助']
            },
            {
                date: '2022/07',
                content: ['成立「琥白股份有限公司」']
            },
            {
                date: '2022/08',
                content: [
                    '與「スズキ株式会社（Suzuki）」、「株式会社エムスクエア・ラボ（m2labo）」合作，共同開發MobileMover'
                ]
            },
            {
                date: '2023/03',
                content: ['與「株式会社CuboRex」合作，取得產品代理權']
            }
        ]
    }
}
export default locale