const locale = {
  global: {
    buttons: {
      next: '下一步',
      prev: '上一步',
      back: '返回',
      close: '關閉',
      submit_form: '送出表單',
      contact_us: '聯絡我們',
      view_the_service: '查看詳細服務',
      view_all_project: '查看所有專案',
      view_more: '查看更多'
    },
    project_types: {
      system: '系統設計與全端開發',
      design: '商業設計與原型製作',
      content: '內容設計與活動統籌'
    },
    footer: {
      address: '（803）高雄市鹽埕區大勇路11號3樓'
    }
  },
  home: {
    title: {
      name: '設計驅動永續',
      slogan: 'Design for Nature',
      text: [
        '我們致力於食農、工藝和地方議題',
        '由 In-house 的設計研究與工程技術團隊，持續實現對永續的無限可能'
      ]
    },
    about: {
      name: '琥白',
      brand: 'Kohaku Studio',
      text: `琥珀，是液態的松脂，化石化的結晶，包裹千萬年前的生命，形成動人的時光膠囊。
      白，是設計中的留白，未被填滿而包容一切的自由。

      在琥白，才能和創意自在流動，去包裹一個個初出的想法， 幾經高壓凝結成獨一無二的寶石，綻放或柔美、或奪目的輝光。 這是一處孵夢之地，邀請你一起野放天馬行空的想法，發展那些大膽的可能。`
    },
    service: {
      text: '你的創新概念準備起跑了嗎？讓琥白幫助您的願景步伐穩健的實現！',
      steps: [
        {
          title: '需求研究',
          text: '首先深入了解需求，從場域、使用者與現實情境，找出問題核心！根據這些發現，為您量身打造解決方案。'
        },
        {
          title: '概念設計',
          text: '進行腦力激盪，構建精彩的原型，接著持續調整與改良，確保這些點子能夠真正幫助您實現目標。'
        },
        {
          title: '落地實現',
          text: '此刻，是時候付諸實踐了！我們整合數位技術，提供全端工程服務，確保每個細節，讓概念完美落地。'
        }
      ]
    },
    solution: [
      {
        title: '系統設計與全端開發',
        text: ['客製資訊系統導入產業', '數位產品服務全端開發'],
        keywords: ['前端設計開發', '後端整合部署', '商業資料探勘', '軟硬體整合設計', '應用程式開發']
      },
      {
        title: '商業設計與原型製作',
        text: ['美學轉譯優雅品牌形象', '量身定制精準傳達願景'],
        keywords: [
          '商業視覺設計',
          '企業識別系統',
          '空間展示設計',
          '介面與互動設計',
          '複合媒材與產品設計'
        ]
      },
      {
        title: '內容設計與活動統籌',
        text: ['以設計研究和永續為核心', '重視實質效益的策略創意'],
        keywords: [
          '永續與循環企劃',
          '服務與體驗設計',
          '課程與活動設計',
          '展覽策劃與執行',
          '數位轉型與再造'
        ]
      }
    ],
    contact: {
      title: '從聯繫開始，拓展永續的無限可能！',
      text: `→ 有想法？告訴我們！
      → 有預算？交給我們！
      → 有目標？一起實現吧！`
    }
  },
  about: {
    description: {
      introduction: `琥白誕生於2021與2022之間
            故事的開始是一群來自不同背景的青年
            因為期望回歸根本的初心，於是扎根於臺灣
            因為對於農業未來的想像，於是深耕於傳產`,

      mission_values: `乘載文化底蘊的同時
            也持續注入新興的能量與創意
            結合地方與國際的思維
            推動資訊與設計的揉和

            從企劃到行銷、
            從設計到開發、
            從產地到產業、
            從傳承到創新

            以跨域整合的思維
            串連起所有的端點
            匯聚不同服務的影響力
            翻轉價值`
    },

    brand: {
      name: '琥白 Kohaku',
      text: `琥珀，是液態的松脂，化石化的結晶，包裹千萬年前的生命，形成動人的時光膠囊。
            白，是設計中的留白，未被填滿而包容一切的自由。

            在琥白，才能和創意自在流動，去包裹一個個初出的想法， 幾經高壓凝結成獨一無二的寶石，綻放或柔美、或奪目的輝光。 這是一處孵夢之地，邀請你一起野放天馬行空的想法，發展那些大膽的可能。`
    },

    milestone: [
      {
        date: '2021/09',
        content: [
          '與「株式会社エムスクエア・ラボ（m2labo）」、「株式会社やさいバス（Vegibus）」合作並獲其投資',
          '成立「創次方股份有限公司」'
        ]
      },
      {
        date: '2022/04',
        content: ['獲111年度教育部「U-start創新創業計畫」第一階段補助']
      },
      {
        date: '2022/07',
        content: ['成立「琥白股份有限公司」']
      },
      {
        date: '2022/08',
        content: [
          '與「スズキ株式会社（Suzuki）」、「株式会社エムスクエア・ラボ（m2labo）」合作，共同開發MobileMover'
        ]
      },
      {
        date: '2023/03',
        content: ['與「株式会社CuboRex」合作，取得產品代理權']
      }
    ]
  },
  work: {
    project_types: {
      all: '全部',
      system: '系統設計與全端開發',
      design: '商業設計與原型製作',
      content: '內容設計與活動統籌',
      placeholder: '請選擇服務'
    },
    projects: {
      1: {
        name: '永續與循環企劃｜小型農業自走車',
        content: `與日本汽車企業合作，針對農業勞動力高齡化的議題，提出小型農業自走車的使用者體驗設計，設計過程考慮農業場域的工作多樣性、適用於農夫的簡易直覺操作流程及介面，並評估環境永續的硬體耗材。`,
        keywords: ['體驗設計', '服務設計', '企業形象定位']
      },
      2: {
        name: '課程與活動設計｜ 科技農業技術工作坊',
        content: `與勞動力發展署南方創客基地合作，鎖定農業場域的應用，規劃暨執行三大主題系列課程「智慧交易」、「智慧管理」、「智慧生產」，整體活動為期一個月，過程引導參與者從設計思考、技術實踐到商業應用的全方位內容，成就軟硬體裝置之整合應用。`,
        keywords: ['課程設計', '活動規劃', '技術指導', '設計思考']
      },
      3: {
        name: '課程與活動設計｜車床技術轉譯研究工作坊',
        content: `與台灣工藝研究單位合作，實地採集影像、口述，細緻保存匠人50年技藝精華以傳承後勁，執行影片剪輯、影像紀錄，並於活動結束當日上映，作為活動結尾。車床活動紀錄連結：https://youtu.be/fygtvFBfvxU`,
        keywords: ['活動紀錄', '影片剪輯', '腳本企劃']
      },
      4: {
        name: '數位轉型與再造｜工藝學習平台',
        content: `與台灣工藝研究單位合作，規劃一式具包容性、全面性的工藝學習平台，整合工藝線上線下學習、展會活動及計畫資源，過程考量多重使用者的功能權限及網頁使用流程，使工藝內涵得以被更直覺地傳遞。`,
        keywords: ['服務設計', '流程規劃', '介面設計', '活動規劃']
      },
      5: {
        name: '空間展示設計｜CEATEC＆農業WEEK',
        content: `於2022年CEATEC及2023年農業WEEK展覽中與日本公司合作進行展場設計，清楚掌握展示目的及深入理解展示商材，並思考如何在情報眾多的展示會場中吸引觀展者的目光，將參展企業及展示商品的價值準確的傳達出去。`,
        keywords: ['空間設計', '展場設計', 'DM設計']
      },
      6: {
        name: '空間展示設計｜超市＆日本新幹線車站',
        content: `於西日本JR地方車站建置無人商店，自陳設、空間、至店內視覺經一致性統籌規劃，兼具舒適感及實用的平衡，達到自在便利的購物體驗。`,
        keywords: ['空間設計', '視覺設計']
      },
      7: {
        name: '農特產品外銷｜屏東台農金鑽鳳梨',
        content: `協助屏東縣綠地農特產品生產合作社與農產經銷日商 Vegibus 對接合作，出口台農17號金鑽鳳梨，直送日本當地高級超市。此為民間推動之農產外銷革新，由農家直送終端消費者，大幅提升產品新鮮度與價格競爭力，縮短外銷途徑提升農民收益，也讓日本民眾享用更新鮮、更便宜的台灣鳳梨。`,
        keywords: ['國際貿易', '外銷服務']
      },
      8: {
        name: '複合媒材與產品設計｜慕廂－優雅收移的實木家具',
        content: `回應當代對室內工作空間靈活、共享等流動性訴求，慕廂收束實木家具的量體，以逐一靠攏的動作取代拆裝，輕鬆的收合桌、椅與邊櫃，並實現優雅不費力的平面推移。`,
        keywords: ['家具設計', '產品設計']
      },
      9: {
        name: '複合媒材與產品設計｜陶廢料再製杯盤＆桌椅組',
        content: `與台灣工藝研究單位合作，運用循環的陶瓷廢料，發揮不同陶瓷廢料材料配方所獨有的紋理及質地，發展出不需濾紙的咖啡陶瓷濾杯「淳次（Puffer）」、契合手掌的器皿「沉次（Paltain）」以及象徵循環軟實力的桌椅「方角（Posible）」，為循環材料帶來新的面貌。`,
        keywords: ['永續設計', '循環材料', '產品設計', '產品製作']
      },
      10: {
        name: '商業視覺設計｜木工藝工具書',
        content: `與台灣工藝研究單位合作，實地採集影像、口述，細緻保存匠人50年技藝精華以傳承後勁，並執行編印出版，完成上架國家書店納入政府出版品。國家書店政府出版品連結：https://www.govbooks.com.tw/books/137952`,
        keywords: ['裝幀設計', '視覺設計', '插畫設計']
      },
      11: {
        name: '商業視覺設計｜日本方公司名片設計',
        content: `火紅的朝陽和夕陽也代表著日本的國旗，兩面圖像象徵企業日出而作，日落不息之精進精神。`,
        keywords: ['名片設計', '視覺設計']
      },
      12: {
        name: '商業視覺設計｜日本區公所名片設計',
        content: `為日本山形縣高畠市地區公所市役場設計機關公務名片。LOGO結合市內之國家有形文化資產「舊高畠車站」，背面雅緻紋理則取自特色礦產「高畠石」。圍繞地方風情的細節增強基層機關與在地的連結，也使初見面的交換名片富饒更多驚喜話題。*畠：音田`,
        keywords: ['名片設計', '視覺設計']
      },
      13: {
        name: '品牌形象識別｜早餐宵夜店平面設計',
        content: `與高雄在地早餐宵夜店合作，將主題意象「元寶」以及店名中的「妤」，配合整體「飽滿」、「鮮明」的風格，提出「圓飽生財 金魚游泳」的平實設計理念，並發展多種應用排列，貼心考量店內各式需求。`,
        keywords: ['LOGO設計', '菜單設計', '招牌設計', '企業形象定位']
      },
      14: {
        name: '品牌形象識別｜韭菜泡菜包裝設計',
        content: `於日本高級超市販售，過程輔導農家運用地產優勢研製韭菜泡菜特產，並協助設計符合上架標準之包裝，增加農產加工增值的效益。`,
        keywords: ['包裝設計', '視覺設計']
      },
      15: {
        name: '產銷系統設計｜日本農產電商物流系統',
        content: `與物流日商合作，致力於推廣農產品地產地銷的供應永續，為既有概念「蔬菜巴士」開發客製化專屬資訊系統，一站整合產地供應、配送貨態、消費訂單與金流資訊，協助實現物流端自多站農家取貨、集運、沿線配送到府之複雜流程。落地營運的 Vegibus 蔬菜巴士，成功建立日本靜岡縣、茨城縣、千葉縣、大阪府等縣的在地農產物流網，讓消費者享受到低碳足跡、高新鮮度的蔬果，並建立友善永續的在地食農關係。`,
        keywords: ['系統開發', '前端開發', '網站介面設計']
      },
      16: {
        name: '機電平台開發｜自主移動機器人控制平台',
        content: `因應農村高齡化勞動力短缺、農業精緻化管理繁瑣等情境，以智慧農機作為未來解方，配合作物管理週期，實現壓草、除草、投藥、收成搬運等全功能農務支援。農用機電整合技術同時考量農場地域模型建構、地圖路徑分析、便利易用的掌上操作系統，並設計以銀髮農戶為對象適應系統的轉型服務流，為農場主減輕經營負擔。`,
        keywords: ['嵌入式系統開發', '前端開發', '網站介面設計']
      },
      17: {
        name: '快速擷單工具｜KOKO BOT',
        content: `LINE不只交友通訊維持感情，更是許多生鮮零售商、餐廳的叫貨好幫手，然而日常用LINE的叫貨過程，卻因為無法系統性地統計，徒增雙方手動「訂單整理」、「金額匯結」的工作量。琥白一站式開發的KOKO LINE用三個步驟，省下日常工作的三十分鐘！`,
        keywords: ['工具開發', '介面設計']
      },
      18: {
        name: '雲端產銷工具｜KOKO SCALE',
        content: `傳統市場中的磅秤只能秤出重量、金額，後續還要手動記錄、彙整當天銷售資訊、列印產品標籤，無法清楚掌握當天的銷售紀錄外，在銷售的過程還要逐筆計算銷售總金額。琥白一站式開發的KOKO SCALE用雲端、藍芽整合管理市場中的銷售數據！`,
        keywords: ['工具開發', '介面設計']
      },
      19: {
        name: '商業視覺設計｜琥白名片設計',
        content: `為琥白股份有限公司名片。琥白局部上光的輪廓代表由正方體打磨成圓體的過程，象徵經由琥白專業的打磨過程後，最後將會變成璀璨的琥珀。`,
        keywords: ['名片設計', '視覺設計']
      }
    }
  },
  services: {
    tool_title: '客製化開發工具',
    example_title: '作品案例',
    system: {
      title: '系統設計與全端開發',
      text: '以 SaaS （Software as a Service）軟體服務出發，提供產業系統客製、跨系統整合服務，串接系統及終端設備，協助收集數據幫助決策，優化流程提升供銷效能。',
      items: [
        {
          title: '前端設計開發',
          list: ['前端框架開發', '前端互動設計', 'RWD 響應式網站']
        },
        {
          title: '後端整合部署',
          list: [
            '資料庫設計與規劃',
            'API 開發 / 第三方 API 串接',
            '雲端架構設計',
            'CI / CD',
            'CMS開發'
          ]
        },
        {
          title: '應用程式開發',
          list: ['漸進式網站應用程式 (PWA)', '跨平台 (Hybrid) 應用程式開發']
        },
        {
          title: '商業資料探勘與分析',
          list: ['商業數據分析與可視化', 'BI 工具導入', '資料收集、轉移與載入自動化']
        },
        {
          title: '軟硬體整合設計',
          list: ['物聯網裝置開發', '嵌入式系統']
        }
      ],
      tools: [
        {
          title: '前端框架',
          list: ['Vue', 'React', 'jQuery']
        },
        {
          title: '前端 UI 框架',
          list: ['Vuetify', 'PrimeVue', 'BootstrapVue']
        },
        {
          title: '前端互動及視覺化',
          list: ['D3.js', 'p5.js', 'Three.js', 'Chart.js']
        },
        {
          title: 'Server端開發工具',
          list: ['Python', 'Flask', 'Django', 'NodeJS']
        },
        {
          title: '資料庫開發',
          list: ['MySQL', 'PostgreSQL', 'MongoDB']
        },

        {
          title: 'API 開發',
          list: ['客製化 API 開發', '整合串接 金流/物流 API', '整合串接 ERP/CRM API']
        },
        {
          title: 'APP 開發',
          list: ['React Native 開發 (Hybrid)', 'Ionic 開發 (Hybrid)']
        },
        {
          title: '雲端架構部署',
          list: ['Amazon Web Services (AWS)']
        },
        {
          title: '部署工具',
          list: ['Docker']
        },
        {
          title: '網站數據分析工具',
          list: ['Google Analytics']
        },
        {
          title: '第三方應用開發',
          list: ['LINE BOT', 'Google App Script']
        }
      ]
    },
    design: {
      title: '商業設計與原型製作',
      text: `由美學切入探究，重新詮釋被忽視的不便之處，展現出優雅的產品與服務。
      一頁視覺、一件包裝，甚至一套服務體驗，都將是您精確地傳達願景的載體。

      我們的著重於探討與人之間的默契連結，透過設計轉譯，讓您的客戶對企業願景感同身受，並增加對產品、服務的信任感。`,
      items: [
        {
          title: '商業視覺設計',
          list: ['裝幀設計', '插畫設計', '平面排版與美術', '永續包裝設計']
        },
        {
          title: '企業識別系統',
          list: ['VI 視覺識別', 'BI 行為識別', 'MI 理念識別']
        },
        {
          title: '複合媒材與產品設計',
          list: ['產品外觀設計', '3D模型建構', '模型製作', '多媒材應用']
        },
        {
          title: '空間展示設計',
          list: ['空間視覺', '攤位設計', '展場互動設計']
        },
        {
          title: '介面與互動設計',
          list: ['人機介面設計', '網頁互動設計']
        }
      ]
    },
    content: {
      title: '內容設計與活動統籌',
      text: '以永續為核心，搭配設計驅動轉型與數位策略，重視轉換率與內容，打造人事物更高層次的形象、溝通與體驗，使產業的面貌煥然一新。',
      items: [
        {
          title: '永續與循環企劃',
          list: ['ESG減碳規劃', '永續供應鏈', '循環經濟策略']
        },
        {
          title: '服務與體驗設計',
          list: ['使用者研究', '客戶體驗', '市場與數據分析']
        },
        {
          title: '課程與活動設計',
          list: ['技術課程規劃', '設計工作坊']
        },
        {
          title: '展覽策劃與執行',
          list: ['品牌形象展演', '展覽互動體驗']
        },
        {
          title: '數位轉型與再造',
          list: ['數位典藏與轉譯', '數位工具評估與導入', '作業流程轉型']
        }
      ]
    }
  },
  member: {
    charles: {
      name: '凱元 Charles',
      position: '執行長',
      description: '水瓶座邏輯',
      skills: ['食農供應鏈', '人機互動', '國際企劃', '系統設計'],
      intro: ``
    },
    hannah: {
      name: '詩涵 Hannah',
      position: '技術長',
      description: '把你的問題變成驚喜',
      skills: ['Web-Based 系統架構設計', '專案管理與品質控管', '數據分析與可視化'],
      intro: ``
    },
    arthur: {
      name: '柏維 Arthur',
      position: '全端工程師',
      description: '文科與理組雙作業系統',
      skills: ['API建構與設計', '軟硬體整合開發', '機器人作業系統'],
      intro: ``
    },
    albert: {
      name: '書彥 Albert',
      position: '全端工程師',
      description: '獨角獸愛好者',
      skills: ['伺服器配置', '網站效能優化', '資料庫設計', '資訊安全', 'AI導入'],
      intro: ``
    },
    lily: {
      name: '子涵 Lily',
      position: '硬體工程師',
      description: '我不是在打球就是在打Code',
      skills: ['嵌入式系統開發', '硬體架構設計', '硬體環境相容性評估'],
      intro: ``
    },
    jozie: {
      name: '趯瑾 Jozie',
      position: 'UX 工程師',
      description: '獨立音樂探勘者',
      skills: ['UX', '前端框架開發', '網站模板建置與客製化', 'SEO優化'],
      intro: ``
    },
    ivy: {
      name: '逸青 Ivy',
      position: '商業設計師',
      description: '咖啡杯底 靈感在這裡！',
      skills: ['品牌形象', '參與式設計', '跨域企劃發想與共構', '平面設計', '圖像與插畫設計'],
      intro: ``
    },
    lihsin: {
      name: '立心 Lihsin',
      position: '產品設計師',
      description: '最終確定版.final.final.3dm',
      skills: ['產品設計', '3D建模渲染', '模型製作', 'Rhinoceros 3D', 'KeyShot'],
      intro: ``
    },
    brooke: {
      name: '采倫 Brooke',
      position: '營運長',
      description: '想做南極的設計',
      skills: ['服務設計', '資料規劃', '內容企劃', '活動執行'],
      intro: ``
    },
    andrew: {
      name: '俊宇 Andrew',
      position: '技術顧問',
      description: '用科技發想實現設計巧思！',
      skills: ['人機互動', '空間運算', '電腦圖學', '產品設計'],
      intro: ``
    },
    ti: {
      name: '彩緹 Ti',
      position: '商務開發',
      description: '奇怪可愛也認真專業',
      skills: ['提案與簡報', '陌生開發', '跨域合作規劃與執行', '產品解說介紹'],
      intro: ``
    }
  },
  contact: {
    introduction: {
      title: `承載傳統智慧，設計全新感受`,
      description: `歡迎與琥白分享你的天馬行空，
      我們將為您從微小的點子打造亮眼解方！

      來信說明您的產業需求與價值願景，
      我們會儘速與您聯繫！`
    },
    form: {
      project_type: '專案類型',
      project_types: {
        system: '系統設計與全端開發',
        design: '商業設計與原型製作',
        content: '內容設計與活動統籌'
      },
      budget: '預算',
      budget_placeholder: '例：50000',
      estimated_project_time: '預估專案時間',
      project_content_overview: '專案內容概述',
      project_content_overview_placeholder: '專案目標、初步概念、參考案例',
      contact_person: '聯絡人',
      company_brand_name: '公司 / 品牌名稱',
      company_brand_name_placeholder: '如無請填寫個人',
      contact_number: '聯絡電話',
      contact_email: '聯絡信箱',
      validation: {
        required: '此處不可為空白',
        mail_format: '請輸入正確的信箱格式'
      }
    },
    popup: {
      confirm_submit: '確認送出',
      submit_form_confirmation: '確定要送出表單嗎？',
      thank_you: '謝謝您！',
      form_confirmation_message: '我們已收到您的回覆，並將確認信寄送到您填寫的聯絡信箱。'
    }
  }
}
export default locale
