const locale = {
  global: {
    buttons: {
      next: '下一步',
      prev: '上一步',
      back: '返回',
      close: '關閉',
      submit_form: '送出表單',
      contact_us: '聯絡我們',
      view_the_service: '查看詳細服務',
      view_all_project: '查看所有專案',
      view_more: '查看更多'
    },
    project_types: {
      system: '系統設計與全端開發',
      design: '商業設計與原型製作',
      content: '內容設計與活動統籌'
    },
    footer: {
      address: '（803）高雄市鹽埕區大勇路11號3樓'
    }
  },
  home: {
    title: {
      name: '設計驅動永續',
      slogan: 'Design for Nature',
      text: [
        '我們致力於食農、工藝與製造、地方課題',
        '由 In-house 的設計研究與工程技術團隊，持續實現對永續的無限可能'
      ]
    },
    about: {
      name: '琥白',
      brand: 'Kohaku',
      text: `琥白凝聚了台灣與日本的產官學深厚人脈，透過日系嚴謹的開發經驗與台灣的設計能量，建立起國際間食農、工藝以及地方創生的緊密聯繫。

      琥白年輕且充滿熱情的團隊，以自然為哲學，為未來而設計。

      與我們一同啟航，體驗新穎、綠意盎然的世界。`
    },
    methods: {
      text: '每個在琥白的專案都會經過嚴謹的步驟與一站式服務，確保品質與持續性。',
      steps: [
        {
          title: '需求研究',
          text: '以設計研究方法，從場域、使用者與情境了解真實需求，找出問題核心與執行方向。'
        },
        {
          title: '概念設計',
          text: '進行腦力激盪與原型製作，在溝通中持續迭代，打造能夠真正實現目標的解決方案。'
        },
        {
          title: '落地實現',
          text: '整合相關數位技術，提供客製化全端工程服務，讓概念完美落地，並確保持續性。'
        }
      ]
    },
    services: [
      {
        title: '系統設計與全端開發',
        text: ['客製資訊系統導入產業', '數位產品服務全端開發'],
        keywords: ['前端設計開發', '後端整合部署', '商業資料探勘', '軟硬體整合設計', '應用程式開發']
      },
      {
        title: '商業設計與原型製作',
        text: ['美學轉譯優雅品牌形象', '量身定制精準傳達願景'],
        keywords: [
          '商業視覺設計',
          '企業識別系統',
          '空間展示設計',
          '介面與互動設計',
          '複合媒材與產品設計'
        ]
      },
      {
        title: '內容設計與活動統籌',
        text: ['以設計研究和永續為核心', '重視實質效益的策略創意'],
        keywords: [
          '永續與循環企劃',
          '服務與體驗設計',
          '課程與活動設計',
          '展覽策劃與執行',
          '數位轉型與再造'
        ]
      }
    ],
    contact: {
      title: '從聯繫開始，拓展永續的無限可能！',
      text: `→ 有想法？告訴我們！
      → 有預算？交給我們！
      → 有目標？一起實現吧！`
    }
  },
  about: {
    description: {
      introduction: `琥白誕生於2021與2022之間，故事很多或短或長
      聚集在這裡的，是一群來自不同背景的年輕人
      看過世界，早早的決定扎根臺灣
      把所有對未來的美好想像，轉譯在設計開始的每個日常`,

      mission_values: `他們相信傳產是驅動社會的力量
      也是最需要被進化的
      結合地方與國際的思維
      推動數位轉型
      從企劃到行銷
      從設計到開發
      從產地到產業
      從傳承到創新
      以跨域整合的思維
      保持動態與多樣性
      直接串連起所有端點`
    },

    brand: {
      name: '琥白（Kohaku）',
      text: `琥珀，是液態的松脂，包裹萬物，優雅轉譯。
      白，是設計中的留白，保有自由與想像。

      在琥白，想像和創造自在流動， 共同野放天馬行空的想法，發展那些大膽的可能。`
    },
    milestone: [
      {
        year: 2021,
        title: '創能啟動',
        events: [
          { name: '獲日系資金投資成立創次方股份有限公司，著重客製化軟硬體系統開發' },
          { name: '於高雄設立辦公室' },
          { name: '日商やさいバス委託系統開發與後續維運' }
        ]
      },
      {
        year: 2022,
        title: '工藝跨界',
        events: [
          {
            name: '獲全台最大創新創業競賽 U-Start 資金挹注，成立琥白股份有限公司，著重內容與設計'
          },
          { name: '於台北設立據點' },
          { name: '與日商スズキ及日商エムスクエア・ラボ合作，開發小型移動車控制軟體與服務設計' },
          {
            name: '與國立台灣工藝研究發展中心展開數位轉譯類項合作'
          }
        ]
      },
      {
        year: 2023,
        title: '扎根台灣',
        events: [
          { name: '購回日資部分，創次方成為全資台灣公司' },
          { name: '承攬國立臺灣工藝研究中心案件，進行工藝基因資料庫建置' },
          { name: '與泛科知識股份有限公司合作，於國立成功大學進行農創松課程設計與技術顧問' },
          { name: '於日本連鎖超市成立「台灣攤位」，嚴選台灣農會産品上架販售' },
          { name: '承攬桃園市立大溪木藝生態博物館案件，進行木工藝師研究與內容轉譯' },
          { name: '獲高雄智慧農業補助計畫，開發一式噴藥搬運自走車' },
          { name: '創次方股份有限公司獲高雄 SBIR 資金挹注，永續食農供應鏈前期研究' },
          { name: '與日商アクト中食グループ展開台日食農設計推廣及系統整合之合作' },
          { name: '承攬日商 NTT 西日本之系統設計顧問服務' },
          { name: '與承億集團展開行銷企劃與系統合作，於高雄承億酒店內設立據點' }
        ]
      },
      {
        year: 2024,
        title: '扎根台灣',
        events: [
          { name: '與日商日清紡控股、日商日本無線合作永續養殖漁業軟硬體整合' },
          { name: '與日商 NTT Communications 合作食農市場數位轉型' },
          { name: '承攬日商さかもと株式会社全客製化工廠作業流程自動化系統開發' },
          { name: '與日商 UTS 在台灣成立子公司著重永續農業科技' }
        ]
      }
    ]
  },
  work: {
    project_types: {
      all: '全部',
      system: '系統設計與全端開發',
      design: '商業設計與原型製作',
      content: '內容設計與活動統籌',
      placeholder: '請選擇服務'
    },
    projects: {
      1: {
        name: '模組化農用機具',
        concept: '永續與循環企劃',
        collaborator: '日商公司',
        content: `與日本汽車企業合作，針對農業勞動力高齡化的議題，提出模組化農用機具的使用者體驗設計，設計過程考慮農業場域的工作多樣性、適用於農夫的簡易直覺操作流程及介面，並評估環境永續的硬體耗材，為提高農業生產效率，改善農民的工作環境，促進農業的可持續發展。`,
        keywords: ['體驗設計', '服務設計', '企業形象定位']
      },
      2: {
        name: ' 科技農業技術工作坊',
        concept: '課程與活動設計',
        collaborator: '南方創客基地',
        content: `與勞動力發展署南方創客基地合作，鎖定農業場域的應用，規劃暨執行三大主題系列課程「智慧交易」、「智慧管理」、「智慧生產」，整體活動為期一個月，過程引導參與者從設計思考、技術實踐到商業應用的全方位內容，成就軟硬體裝置之整合應用。`,
        keywords: ['課程設計', '活動規劃', '技術指導', '設計思考']
      },
      3: {
        name: '車床技術轉譯研究工作坊',
        concept: '課程與活動設計',
        collaborator: '國立臺灣工藝研究發展中心',
        content: `與臺灣工藝中心合作，實地採集影像、口述，細緻保存匠人50年技藝精華以傳承後勁，執行影片剪輯、影像紀錄，並於活動結束當日上映，作為活動結尾。車床活動紀錄連結：https://youtu.be/fygtvFBfvxU`,
        keywords: ['活動紀錄', '影片剪輯', '腳本企劃']
      },
      4: {
        name: '工藝學習平台',
        concept: '數位轉型與再造',
        collaborator: '國立臺灣工藝研究發展中心',
        content: `與臺灣工藝中心合作，規劃具包容性、全面性的工藝學習平台，整合工藝線上線下學習、展會活動及計畫資源，過程考量多重使用者的功能權限及網頁使用流程，使工藝內涵得以被更直覺地傳遞。`,
        keywords: ['服務設計', '流程規劃', '介面設計', '活動規劃']
      },
      5: {
        name: 'CEATEC＆農業WEEK',
        concept: '空間展示設計',
        collaborator: '日商公司',
        content: `於2022年日本最先端電子資訊高科技綜合展——CEATEC，以及2023年日本最頂尖專業的國際農業技術貿易展覽會——農業WEEK展覽中，與日本公司合作進行展場設計，清楚掌握展示目的及深入理解展示商材，並思考如何在情報眾多的展示會場中吸引觀展者的目光，將參展企業及展示商品的價值準確的傳達出去。`,
        keywords: ['空間設計', '展場設計', 'DM設計']
      },
      6: {
        name: '日本展售空間設計',
        concept: '空間展示設計',
        collaborator: 'JR西日本地方車站、日本廣島SOGO',
        content: `於JR西日本地方車站建置無人商店，以及於日本廣島SOGO規劃商品陳列空間，透過精心統籌設計，確保陳設、空間佈局和店內視覺風格的一致性，同時注重營造舒適感和實用性。在考慮商品展示效果的同時，也十分關注顧客在購物過程中的舒適度和便利性，致力於打造一個令人愉悅且貼心的購物環境，讓顧客能夠自在地享受購物體驗。`,
        keywords: ['空間設計', '視覺設計']
      },
      7: {
        name: '屏東台農金鑽鳳梨',
        concept: '農特產品外銷',
        collaborator: '綠地農特產品生產合作社、日商公司',
        content: `協助屏東縣綠地農特產品生產合作社與農產經銷日商公司對接合作，出口台農17號金鑽鳳梨，直送日本當地高級超市。此為民間推動之農產外銷革新，由農家直送終端消費者，大幅提升產品新鮮度與價格競爭力，縮短外銷途徑提升農民收益，也讓日本民眾享用更新鮮、更便宜的台灣鳳梨。`,
        keywords: ['國際貿易', '外銷服務']
      },
      8: {
        name: '慕廂－優雅收移的實木家具',
        concept: '複合媒材與產品設計',
        collaborator: '琥白自有品牌',
        content: `回應當代對室內工作空間靈活、共享等流動性訴求，慕廂收束實木家具的量體，以逐一靠攏的動作取代拆裝，輕鬆的收合桌、椅與邊櫃，並實現優雅不費力的平面推移。`,
        keywords: ['家具設計', '產品設計']
      },
      9: {
        name: '陶廢料再製杯盤＆桌椅組',
        concept: '複合媒材與產品設計',
        collaborator: '國立臺灣工藝研究發展中心',
        content: `與臺灣工藝中心合作，共同執行循環工藝計畫，運用循環的陶瓷廢料，發揮不同陶瓷廢料材料配方所獨有的紋理及質地，發展出不需濾紙的咖啡陶瓷濾杯「淳次（Puffer）」、契合手掌的器皿「沉次（Paltain）」以及象徵循環軟實力的桌椅「方角（Posible）」，為循環材料帶來新的面貌。`,
        keywords: ['永續設計', '循環材料', '產品設計', '產品製作']
      },
      10: {
        name: '木工藝工具書',
        concept: '商業視覺設計',
        collaborator: '國立臺灣工藝研究發展中心',
        content: `與臺灣工藝中心合作，為台灣國寶級木藝大師——黃俊傑老師進行木工藝工具書書籍設計，透過實地採集影像、口述，細緻保存匠人50年技藝精華以傳承後勁，並執行編印出版，完成上架國家書店納入政府出版品。國家書店政府出版品連結：https://www.govbooks.com.tw/books/137952`,
        keywords: ['裝幀設計', '視覺設計', '插畫設計']
      },
      11: {
        name: '日商公司名片設計',
        concept: '商業視覺設計',
        collaborator: '日商公司',
        content: `火紅的朝陽和夕陽也代表著日本的國旗，兩面圖像象徵企業日出而作，日落不息之精進精神。`,
        keywords: ['名片設計', '視覺設計']
      },
      12: {
        name: '日本區公所名片設計',
        concept: '商業視覺設計',
        collaborator: '日本山形縣高畠市地區公所',
        content: `為日本山形縣高畠市地區公所市役場設計機關公務名片。LOGO結合市內之國家有形文化資產「舊高畠車站」，背面雅緻紋理則取自特色礦產「高畠石」。圍繞地方風情的細節增強基層機關與在地的連結，也使初見面的交換名片富饒更多驚喜話題。*畠：音田`,
        keywords: ['名片設計', '視覺設計']
      },
      13: {
        name: '早餐宵夜店平面設計',
        concept: '品牌形象識別',
        collaborator: '',
        content: `與高雄在地早餐宵夜店合作，將主題意象「元寶」以及店名中的「妤」，配合整體「飽滿」、「鮮明」的風格，提出「圓飽生財 金魚游泳」的平實設計理念，並發展多種應用排列，貼心考量店內各式需求。`,
        keywords: ['LOGO設計', '菜單設計', '招牌設計', '企業形象定位']
      },
      14: {
        name: '韭菜泡菜包裝設計',
        concept: '品牌形象識別',
        collaborator: '日商公司',
        content: `此款韭菜泡菜於日本高級超市販售。合作過程中包含了對農家的專業輔導，以協助其充分利用當地的地產優勢，研發出獨具特色的韭菜泡菜特產。同時，致力於設計出符合上架標準的包裝，不僅提升了產品的市場競爭力，也有效地提高了農產品的加工增值，進一步增進了農業產業的整體效益，推動農業領域的創新與發展，為市場提供高品質的農產品。`,
        keywords: ['包裝設計', '視覺設計']
      },
      15: {
        name: '日本農產電商物流系統',
        concept: '產銷系統設計',
        collaborator: '日商公司',
        content: `與物流日商合作，開發客製化專屬資訊系統，一站整合產地供應、配送貨態、消費訂單與金流資訊。致力於推廣農產品地產地銷的供應永續，協助多站農家取貨、集運、沿線配送到府之複雜流程。成功建立日本靜岡縣、茨城縣、千葉縣、北海道、廣島縣等的在地農產物流網，讓消費者享受到低碳足跡、高新鮮度的蔬果，並建立友善永續的在地食農關係。`,
        keywords: ['系統開發', '前端開發', '網站介面設計']
      },
      16: {
        name: '自主移動機器人控制平台',
        concept: '機電平台開發',
        collaborator: '日商公司',
        content: `因應農村高齡化勞動力短缺、農業精緻化管理繁瑣等情境，以智慧農機作為未來解方，配合作物管理週期，實現壓草、除草、投藥、收成搬運等全功能農務支援。農用機電整合技術同時考量農場地域模型建構、地圖路徑分析、便利易用的掌上操作系統，並設計以銀髮農戶為對象適應系統的轉型服務流，為農場主減輕經營負擔。`,
        keywords: ['嵌入式系統開發', '前端開發', '網站介面設計']
      },
      17: {
        name: 'KOKO BOT',
        concept: '快速擷單工具',
        collaborator: '琥白自有品牌',
        content: `LINE不只交友通訊維持感情，更是許多生鮮零售商、餐廳的叫貨好幫手，然而日常用LINE的叫貨過程，卻因為無法系統性地統計，徒增雙方手動「訂單整理」、「金額匯結」的工作量。琥白一站式開發的KOKO BOT用三個步驟，省下日常工作的三十分鐘，同時支援三種語言！`,
        keywords: ['工具開發', '介面設計', 'LINE Bot']
      },
      18: {
        name: 'KOKO SCALE',
        concept: '雲端產銷工具',
        collaborator: '琥白自有品牌',
        content: `傳統市場中的磅秤只能秤出重量、金額，後續還要手動記錄、彙整當天銷售資訊、列印產品標籤，無法清楚掌握當天的銷售紀錄外，在銷售的過程還要逐筆計算銷售總金額。琥白一站式開發的KOKO SCALE用雲端、藍芽整合管理市場中的銷售數據！`,
        keywords: ['工具開發', '介面設計']
      },
      19: {
        name: '琥白名片設計',
        concept: '商業視覺設計',
        collaborator: '琥白自有品牌',
        content: `為琥白股份有限公司名片。琥白局部上光的輪廓代表由正方體打磨成圓體的過程，象徵經由琥白專業的打磨過程後，最後將會變成璀璨的琥珀。藉由一張有故事的名片，開啟與對方對話的契機，同時闡述企業的品牌故事，傳遞琥白的核心價值。`,
        keywords: ['名片設計', '視覺設計']
      },
      20: {
        name: '南島日常果乾品牌設計',
        concept: '品牌形象識別',
        collaborator: '萬屋休閒農場',
        content: `為屏東休閒農場的果乾進行品牌設計，以「日常」為核心發想、以「溫暖」為設計基調，為品牌風格塑形，打造系列品牌方案，讓人們可以透過品牌看見南島日常的樣貌、透過產品嚐到南島日常的滋味。`,
        keywords: ['品牌設計', '視覺設計', '包裝設計']
      },
      21: {
        name: 'ACT日本米包裝設計',
        concept: '品牌形象識別',
        collaborator: 'アクト中食グループ、鼎三國際企業',
        content: `與日商公司合作，為日本米進行包裝設計，並協助後續賣至台灣高級百貨。以日系簡約風格為主軸，從紙質的挑選到視覺的設計，都圍繞在純淨與自然之間，精心雕琢每個細節，呈現出高品質與獨特的美感，以獨具匠心的設計作為日本米的品質詮釋。Ｆ`,
        keywords: ['包裝設計', '視覺設計']
      },
      22: {
        name: '台日香蕉試食會',
        concept: '整合行銷企劃',
        collaborator: '弘運物產開發公司、アクト中食グループ',
        content: `與弘運物產合作，共同執行「112年香蕉產業策略聯盟統籌示範計畫」，於日本アクト中食廣島地區超市，辦理香蕉鮮果與加工品宣傳展售會，擴大當地販售區域，增加市場能見度，增加台灣香蕉銷售量，促進臺灣香蕉產業永續發展，增加民眾購買意願及提升回購率。`,
        keywords: ['活動籌辦', '行銷推廣', '跨國行銷']
      },
      23: {
        name: '永續與循環經濟工作坊',
        concept: '課程與活動設計',
        collaborator: '國立成功大學創意產業設計研究所',
        content: `與國立成功大學合作，舉辦一日工作坊，從「商業」、「設計」、「永續」三面向切入，探究循環設計背後的全貌，培養面對永續的獨立思辨能力，以及綜觀全局的系統思考能力；同時介紹由農業剩餘資源的鳳梨葉再製成的鳳梨纖維，以跨域思維探索更廣泛的見解，提出可持續的永續創新解方、可實踐的永續生活型態。`,
        keywords: ['課程設計', '活動規劃', '設計思考', '永續設計']
      },
      24: {
        name: '工藝元基因建構',
        concept: '知識建構與整合',
        collaborator: '國立臺灣工藝研究發展中心',
        content: `與臺灣工藝中心合作，以整合工藝知識內涵為目標，協助其獲得結構性整合，資料範疇包含工藝書籍知識拆解與工藝家訪談記錄，同時實踐工藝基因庫系統之資料維護，成為工藝在產業與學術發展的支持系統。`,
        keywords: ['知識拆解', '資料整合', '訪談紀錄']
      },
      25: {
        name: '大溪木藝師調查紀錄計畫',
        concept: '知識建構與整合',
        collaborator: '桃園市立大溪木藝生態博物館',
        content: `與桃園木博館合作，本研究以隆盛木器行的林宜鎰木藝師為研究對象。透過深入了解木藝師的生命故事和對大溪木藝產業的參與，探討產業興盛的脈絡和關鍵因素，由此建立調查研究架構，逐步累積各位木藝師之個人經驗與人物誌，作為木博館後續統籌研究與推廣資源之基礎。`,
        keywords: ['資料整合', '脈絡梳理', '訪談紀錄']
      },
      26: {
        name: 'ACT RPA開發',
        concept: '機器人流程自動化',
        collaborator: 'アクト中食グループ',
        content: `為日商公司設計一套RPA機器人流程自動化，將傳統的工作流自動化，由系統執行重複繁瑣的動作，並自動完成匯入、檢查、下載、發送郵件等工作項目，大幅提高企業工作的準確性和效率。`,
        keywords: ['系統開發', 'RPA開發', '流程自動化']
      },
      27: {
        name: '遙控智慧噴霧車',
        concept: '機電整合開發',
        collaborator: '高雄市政府農業局、欣奇農場',
        content: `與高雄市政府農業局及在地農民合作進行農機開發，主要用於木瓜網室噴灑農藥情境。具有模組化設計，可用於農藥噴灑，也可在卸下作為搬運車使用。可遠距遙控或搖桿控制，並具有三段式速度控制。噴灑功能整合雙水泵供應系統和廣角噴片，提高效率和覆蓋範圍。透過在農業生產端導入智慧化農機具，有效提升農民朋友的工作效率與工作品質。影片連結：https://youtu.be/hmpxN4J3Os8?si=Dpjam4J13jXvEPgF`,
        keywords: ['智慧農機開發', '機電整合', '模組化設計']
      },
      28: {
        name: '植物水分資料通知LINE Bot',
        concept: 'LINE Bot整合開發',
        collaborator: '沃畝股份有限公司、工業技術研究院、高雄科技大學',
        content: `與沃畝、工研院、高科大合作，開發一套整合LINE Bot、Google Apps Script和Google Sheets的系統，專為植物水分測量系統的資料即時監測而設計。該系統能自動讀取Google Sheets上的資料，並即時傳送給已綁定的LINE Bot用戶，用戶亦可主動獲取最新資料。透過該系統，用戶可以方便地利用手機收取植物水分測量資訊，大幅增加資料傳遞的即時性。`,
        keywords: ['整合開發', 'LINE Bot開發', '自動化資料讀取']
      }
    }
  },
  services: {
    tool_title: '客製化開發工具',
    example_title: 'Work',
    system: {
      title: '系統設計與全端開發',
      text: '以 SaaS （Software as a Service）軟體服務出發，提供產業系統客製、跨系統整合服務，串接系統及終端設備，協助收集數據幫助決策，優化流程提升供銷效能。',
      items: [
        {
          title: '前端設計開發',
          list: ['前端框架開發', '前端互動設計', 'RWD 響應式網站']
        },
        {
          title: '後端整合部署',
          list: [
            '資料庫設計與規劃',
            'API 開發 / 第三方 API 串接',
            '雲端架構設計',
            'CI / CD',
            'CMS開發'
          ]
        },
        {
          title: '應用程式開發',
          list: ['漸進式網站應用程式 (PWA)', '跨平台 (Hybrid) 應用程式開發']
        },
        {
          title: '商業資料探勘與分析',
          list: ['商業數據分析與可視化', 'BI 工具導入', '資料收集、轉移與載入自動化']
        },
        {
          title: '軟硬體整合設計',
          list: ['物聯網裝置開發', '嵌入式系統']
        }
      ],
      tools: [
        {
          title: '前端框架',
          list: ['Vue', 'React', 'jQuery']
        },
        {
          title: '前端 UI 框架',
          list: ['Vuetify', 'PrimeVue', 'BootstrapVue']
        },
        {
          title: '前端互動及視覺化',
          list: ['D3.js', 'p5.js', 'Three.js', 'Chart.js']
        },
        {
          title: 'Server端開發工具',
          list: ['Python', 'Flask', 'Django', 'NodeJS']
        },
        {
          title: '資料庫開發',
          list: ['MySQL', 'PostgreSQL', 'MongoDB']
        },

        {
          title: 'API 開發',
          list: ['客製化 API 開發', '整合串接 金流/物流 API', '整合串接 ERP/CRM API']
        },
        {
          title: 'APP 開發',
          list: ['React Native 開發 (Hybrid)', 'Ionic 開發 (Hybrid)']
        },
        {
          title: '雲端架構部署',
          list: ['Amazon Web Services (AWS)']
        },
        {
          title: '部署工具',
          list: ['Docker']
        },
        {
          title: '網站數據分析工具',
          list: ['Google Analytics']
        },
        {
          title: '第三方應用開發',
          list: ['LINE BOT', 'Google App Script']
        }
      ]
    },
    design: {
      title: '商業設計與原型製作',
      text: `由美學切入探究，重新詮釋被忽視的不便之處，展現出優雅的產品與服務。
      一頁視覺、一件包裝，甚至一套服務體驗，都將是您精確地傳達願景的載體。

      我們的著重於探討與人之間的默契連結，透過設計轉譯，讓您的客戶對企業願景感同身受，並增加對產品、服務的信任感。`,
      items: [
        {
          title: '商業視覺設計',
          list: ['裝幀設計', '插畫設計', '平面排版與美術', '永續包裝設計']
        },
        {
          title: '企業識別系統',
          list: ['VI 視覺識別', 'BI 行為識別', 'MI 理念識別']
        },
        {
          title: '複合媒材與產品設計',
          list: ['產品外觀設計', '3D模型建構', '模型製作', '多媒材應用']
        },
        {
          title: '空間展示設計',
          list: ['空間視覺', '攤位設計', '展場互動設計']
        },
        {
          title: '介面與互動設計',
          list: ['人機介面設計', '網頁互動設計']
        }
      ]
    },
    content: {
      title: '內容設計與活動統籌',
      text: '以永續為核心，搭配設計驅動轉型與數位策略，重視轉換率與內容，打造人事物更高層次的形象、溝通與體驗，使產業的面貌煥然一新。',
      items: [
        {
          title: '永續與循環企劃',
          list: ['ESG減碳規劃', '永續供應鏈', '循環經濟策略']
        },
        {
          title: '服務與體驗設計',
          list: ['使用者研究', '客戶體驗', '市場與數據分析']
        },
        {
          title: '課程與活動設計',
          list: ['技術課程規劃', '設計工作坊']
        },
        {
          title: '展覽策劃與執行',
          list: ['品牌形象展演', '展覽互動體驗']
        },
        {
          title: '數位轉型與再造',
          list: ['數位典藏與轉譯', '數位工具評估與導入', '作業流程轉型']
        }
      ]
    }
  },
  member: {
    charles: {
      name: 'Charles',
      position: '執行長',
      description: '水瓶座邏輯',
      skills: ['食農供應鏈', '人機互動', '國際企劃', '系統設計'],
      intro: ``
    },
    hannah: {
      name: 'Hannah',
      position: '技術長',
      description: '把你的問題變成驚喜',
      skills: ['Web-Based 系統架構設計', '專案管理與品質控管', '數據分析與可視化'],
      intro: ``
    },
    arthur: {
      name: 'Arthur',
      position: '全端工程師',
      description: '文科與理組雙作業系統',
      skills: ['API建構與設計', '軟硬體整合開發', '機器人作業系統'],
      intro: ``
    },
    albert: {
      name: 'Albert',
      position: '全端工程師',
      description: '獨角獸愛好者',
      skills: ['伺服器配置', '網站效能優化', '資料庫設計', '資訊安全', 'AI導入'],
      intro: ``
    },
    lily: {
      name: 'Lily',
      position: '硬體工程師',
      description: '我不是在打球就是在打Code',
      skills: ['嵌入式系統開發', '硬體架構設計', '硬體環境相容性評估'],
      intro: ``
    },
    jozie: {
      name: 'Jozie',
      position: 'UX 工程師',
      description: '獨立音樂探勘者',
      skills: ['UX', '前端框架開發', '網站模板建置與客製化', 'SEO優化'],
      intro: ``
    },
    ivy: {
      name: 'Ivy',
      position: '商業設計師',
      description: '咖啡杯底 靈感在這裡！',
      skills: ['品牌形象', '參與式設計', '跨域企劃發想與共構', '平面設計', '圖像與插畫設計'],
      intro: ``
    },
    lihsin: {
      name: 'Lihsin',
      position: '產品設計師',
      description: '最終確定版.final.final.3dm',
      skills: ['產品設計', '3D建模渲染', '模型製作', 'Rhinoceros 3D', 'KeyShot'],
      intro: ``
    },
    brooke: {
      name: 'Brooke',
      position: '營運長',
      description: '想做南極的設計',
      skills: ['服務設計', '資料規劃', '內容企劃', '活動執行'],
      intro: ``
    },
    andrew: {
      name: 'Andrew',
      position: '技術顧問',
      description: '用科技發想實現設計巧思！',
      skills: ['人機互動', '空間運算', '電腦圖學', '產品設計'],
      intro: ``
    },
    ti: {
      name: 'Ti',
      position: '商務開發',
      description: '奇怪可愛也認真專業',
      skills: ['提案與簡報', '陌生開發', '跨域合作規劃與執行', '產品解說介紹'],
      intro: ``
    }
  },
  contact: {
    introduction: {
      title: `以自然為哲學，為未來而設計`,
      description: `歡迎與我們分享您的產業需求，讓我們一起從想像開始，共創未來`
    },
    form: {
      project_type: '專案類型',
      project_types: {
        system: '系統設計與全端開發',
        design: '商業設計與原型製作',
        content: '內容設計與活動統籌'
      },
      budget: '預算',
      budget_placeholder: '例：50000',
      estimated_project_time: '預估專案時間',
      project_content_overview: '專案內容概述',
      project_content_overview_placeholder: '專案目標、初步概念、參考案例',
      contact_person: '聯絡人',
      company_brand_name: '公司 / 品牌名稱',
      company_brand_name_placeholder: '如無請填寫個人',
      contact_number: '聯絡電話',
      contact_email: '聯絡信箱',
      validation: {
        required: '此處不可為空白',
        mail_format: '請輸入正確的信箱格式'
      }
    },
    popup: {
      confirm_submit: '確認送出',
      submit_form_confirmation: '確定要送出表單嗎？',
      thank_you: '謝謝您！',
      form_confirmation_message: '我們已收到您的回覆，並將確認信寄送到您填寫的聯絡信箱。'
    }
  }
}
export default locale
